{"expand":"renderedFields,names,schema,operations,editmeta,changelog,versionedRepresentations","id":"15054","self":"https://eucalyptus.atlassian.net/rest/api/2/issue/15054","key":"EUCA-3207","fields":{"issuetype":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issuetype/6","id":"6","description":"A big user story that needs to be broken down. Created by JIRA Software - do not edit or delete.","iconUrl":"https://eucalyptus.atlassian.net/secure/viewavatar?size=xsmall&avatarId=14807&avatarType=issuetype","name":"Epic","subtask":false,"avatarId":14807},"timespent":null,"customfield_13100":null,"project":{"self":"https://eucalyptus.atlassian.net/rest/api/2/project/10000","id":"10000","key":"EUCA","name":"Eucalyptus","avatarUrls":{"48x48":"https://eucalyptus.atlassian.net/secure/projectavatar?pid=10000&avatarId=10011","24x24":"https://eucalyptus.atlassian.net/secure/projectavatar?size=small&pid=10000&avatarId=10011","16x16":"https://eucalyptus.atlassian.net/secure/projectavatar?size=xsmall&pid=10000&avatarId=10011","32x32":"https://eucalyptus.atlassian.net/secure/projectavatar?size=medium&pid=10000&avatarId=10011"}},"customfield_11000":null,"fixVersions":[{"self":"https://eucalyptus.atlassian.net/rest/api/2/version/10112","id":"10112","description":"Eucalyptus 3.2.0","name":"3.2.0","archived":false,"released":true,"releaseDate":"2012-12-19"}],"customfield_11001":null,"aggregatetimespent":null,"resolution":{"self":"https://eucalyptus.atlassian.net/rest/api/2/resolution/1","id":"1","description":"A fix for this issue is checked into the tree and tested.","name":"Fixed"},"customfield_10310":null,"customfield_11401":null,"customfield_10311":null,"customfield_11400":null,"customfield_10104":[],"customfield_10303":null,"customfield_10105":null,"customfield_10304":[{"self":"https://eucalyptus.atlassian.net/rest/api/2/version/10112","id":"10112","description":"Eucalyptus 3.2.0","name":"3.2.0","archived":false,"released":true,"releaseDate":"2012-12-19"}],"customfield_10700":null,"customfield_10701":null,"customfield_10702":null,"customfield_10306":null,"customfield_10703":null,"customfield_10704":null,"resolutiondate":"2015-08-24T18:18:17.196-0500","customfield_10308":null,"customfield_10705":null,"customfield_10309":null,"workratio":-1,"lastViewed":null,"watches":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-3207/watchers","watchCount":2,"isWatching":false},"created":"2012-08-05T14:13:58.673-0500","customfield_12000":null,"priority":{"self":"https://eucalyptus.atlassian.net/rest/api/2/priority/2","iconUrl":"https://eucalyptus.atlassian.net/images/icons/priorities/critical.svg","name":"Critical","id":"2"},"customfield_12400":null,"customfield_12201":null,"customfield_10102":null,"customfield_12600":"{}","labels":[],"customfield_11303":null,"customfield_11700":null,"timeestimate":null,"aggregatetimeoriginalestimate":null,"customfield_11901":null,"versions":[],"issuelinks":[],"assignee":null,"updated":"2015-08-24T18:18:17.227-0500","status":{"self":"https://eucalyptus.atlassian.net/rest/api/2/status/6","description":"The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.","iconUrl":"https://eucalyptus.atlassian.net/images/icons/statuses/generic.png","name":"Closed","id":"6","statusCategory":{"self":"https://eucalyptus.atlassian.net/rest/api/2/statuscategory/3","id":3,"key":"done","colorName":"green","name":"Done"}},"components":[],"timeoriginalestimate":null,"description":"3.2 Euca User UI Requirements\r\n\r\nThe goal of User App is to facilitate the consumption of services exposed by Eucalyptus 3 platform to end users. Eucalyptus User App will be open sourced to help customers modify and suit their needs. User App does not provide user management or cloud infrastructure administration functionality. Wrt user administration operations (including password, key, certs), users will need to continue using the existing UI/CLI methods and is not addressed here.\r\n\r\nRequirements are broken into two categories:\r\n\r\nFunctional Requirements: the functionality which is needed by an implementation of this feature.\r\nArchitectural Constraints: the (architectural) quality attributes an implementation of this feature must fall within.\r\n\r\nFunctional Requirements\r\n\r\nThese are broken into two categories: characteristics of the UI and Eucalyptus operations available through the UI (in terms of their CLI counterpart).\r\n\r\n\r\nUI Requirements\r\n\r\nServer\r\n\r\naccess app using https as default (can accommodate deployments using only http in the future)\r\nssl certificate can be configured (but configuration is /not/ required; has sane default behaviour)\r\naccess app using a single endpoint (even when multiple server instances are deployed for HA)\r\nUI\r\n\r\nui will be a rich client application (e.g., ajax) – workflows can be implemented w/o page reloads\r\neach ui operation/workflow will have a specified presentation mode: e.g., modal dialog, panel, menu item, etc. These will be present in a separate GUI specification.\r\napplication style guide will define the look & feel for the ui.\r\nui elements should change in the display without requiring refresh and re-draw of the entire page. e.g. if selecting one option in a widget causes additional widgets to display, the entire page should not need to re-load to display them.\r\nthe target display resolution for the ui will be 1024×768; additional specification for small-form factor browsers will be elaborated in the GUI specification.\r\ncompatible with html5 browsers:\r\nTested/Guaranteed browser: Firefox\r\nTested/Best-effort browsers: IE 9, Google Chrome, Safari\r\nSupport for tablets/phones: mobile browser user-agent detection and rendering for html5 capable devices\r\neven if this becomes out of scope, the ability to support this in the future is required of the UI\r\nauthentication shall be done using Eucalyptus created user and password\r\nui will poll resource state to allow for discovery of async state changes\r\nui will display errors resulting from synchronous operations (i.e., not discover async errors) and report the underlying error message\r\nui filtering lists of presented resources, esp. for /really large/ resource lists (s4)\r\nui will be capable of receiving large datasets of resource information (s4)\r\nui will distinguish between summary (at-a-glance) properties and detail properties where:\r\nsummary properties will be available when resources are viewed w/o focus, drilling down\r\ndetailed properties will be available by expanding/drilling down into a specific resource\r\nsummary properties will be determined and specified in the GUI specification\r\ndetailed properties will include all properties as reported by Eucalyptus backend services\r\ndetailed properties will include relationship information (e.g., attached volumes, associated addresses, etc.) (s4)\r\nGeneral Operations Requirements\r\n\r\nui will not allow for user management, including password reset. to allow for password reset the admin ui must be used and the user ui will make a clear separation (e.g., visit this other site to administer user information) exists when needing to initiate this operation.\r\nprovides a summary overview of ec2 resource allocation quantities: instances, keypairs, addresses, volumes, snapshots, security groups, images. used for understand quota and capacity planning. (s4)\r\nCHRIS: elaborate on quota information discovery\r\nlaunch configuration cloning: user can take an existing instance and use its configuration to prepopulate the run-instance workflow (this excludes addresses and volumes) (s3)\r\nsnapshot permissions for sharing w/ others (s4)\r\nCHRIS: cross accounts?\r\ninstance access: initiate ssh and RDP sessions (s4, SHASHI: desired, may become a requirement)\r\nsecurity groups: rule creation/modification suggests common rules (ssh+rdp)\r\nkeypairs: key usage is intended primarily for use outside of UI (i.e., not like rightscale)\r\nimage actions: launch instance from image (doesn't need API, would just take the user to launch instance panel with image pre-selected)\r\n\r\nEucalyptus Operations Requirements\r\n\r\nResource                 Command\t              Supported\t Notes\r\naddress\t                 euca-allocate-address  \t yes\t -\r\n                         euca-associate-address \t yes\t -\r\n                         euca-disassociate-address\t yes\t -\r\n                         euca-release-address   \t yes\t -\r\n                         euca-describe-addresses\t yes\t -\r\nzones\t               euca-describe-availability-zones\t yes\t -\r\nbundle\t                 euca-bundle-instance\t desired\t -\r\n                         euca-cancel-bundle-task\t desired -\r\n                         euca-delete-bundle\t         desired -\r\n                         euca-describe-bundle-tasks\t desired -\r\ngroups\t                 euca-add-group\t                 yes\t -\r\n                         euca-create-group      \t yes\t -\r\n                         euca-delete-group\t         yes\t -\r\n                         euca-describe-group\t         yes\t -\r\n                         euca-describe-groups\t         yes\t -\r\n                         euca-authorize\t                 yes\t -\r\n                         euca-revoke\t                 yes\t -\r\nimages\t                 euca-register\t                 yes\t also, support for BFE images\r\n                         euca-deregister\t         yes\t -\r\n                         euca-describe-images\t         yes\t -\r\n                         euca-describe-image-attribute\t s4\t -\r\n                         euca-modify-image-attribute\t s4\t -\r\n                         euca-reset-image-attribute\t s4\t -\r\n                         euca-create-image\t         no      -\r\ninstances\t         euca-describe-instances\t yes\t -\r\n                         euca-reboot-instances\t         yes\t -\r\n                         euca-run-instances\t         yes\t -\r\n                         euca-start-instances\t         yes\t -\r\n                         euca-stop-instances\t         yes\t -\r\n                         euca-terminate-instances\t yes\t -\r\n                         euca-get-console-output\t yes\t -\r\n                         euca-monitor-instances\t         no\t -\r\n                         euca-unmonitor-instances\t no\t -\r\n                         euca-confirm-product-instance\t no\t -\r\nkeypairs\t         euca-add-keypair\t         yes\t -\r\n                         euca-create-keypair\t         yes\t -\r\n                         euca-delete-keypair\t         yes\t -\r\n                         euca-import-keypair\t         no\t -\r\n                         euca-describe-keypairs\t         yes\t -\r\npassword\t         euca-get-password\t         yes\t -\r\n                         euca-get-password-data\t         no\t -\r\nregions\t                 euca-describe-regions\t         yes\t -\r\nsnapshots\t         euca-create-snapshot\t         yes\t -\r\n                         euca-delete-snapshot\t         yes\t -\r\n                         euca-describe-snapshots\t yes\t -\r\nvolumes\t                 euca-attach-volume\t         yes\t -\r\n                         euca-create-volume\t         yes\t -\r\n                         euca-delete-volume\t         yes\t -\r\n                         euca-detach-volume\t         yes\t also, force detach\r\n                         euca-describe-volumes\t         yes\t -\r\nami tools\t         euca-bundle-image\t         no\t -\r\n                         euca-bundle-vol\t         no\t -\r\n                         euca-bundle-upload\t         no\t -\r\n                         euca-unbundle\t                 no\t -\r\n                         euca-download-bundle\t         no\t -\r\n                         euca-upload-bundle\t         no\t -\r\nbucket\t                 euca-check-bucket\t         no\t -\r\ntags\t                 euca-create-tags\t         no\t -\r\n                         euca-delete-tags\t         no\t -\r\n                         euca-describe-tags\t         no\t -\r\nother\t                 euca-version\t                 no\t -\r\n\r\nWalrus Operations Requirements\r\n\r\nBasic operations on service: List buckets\r\nBasic operations on buckets: Create, Delete, List contents, Change Permissions (ACLs).\r\nBasic operations on keys: Upload, List, Delete, Download, Versioning.\r\nShould have the ability to add bucket policies in the future.\r\nSHASHI: flat view is OK!\r\n\r\nArchitectural Constraints\r\n\r\n\r\nScalability, Availability & Statelessness\r\n\r\nsupports 150 of concurrent users, capacity can be increased\r\nsupports both the transfer and display of large number of resources for display: 1.5k images, 100k volumes/snapshots, 15k instances.\r\nthe server providing UI access should acts as a stateless proxy intermediating access between the end UI and underlying Eucalyptus service operations\r\nthe ui server shall be highly available: that is, it can be instantiated multiple times and deployed in a way that allows for transparent redundancy of the service.\r\nstatelessness:\r\nthe server providing UI access should be stateless.\r\nA stateless service is one where the data needed to process a service request is discarded after completing the service request.\r\nIn other words, it must not matter whether a subsequent service request is performed against the same or another instance of the web ui service.\r\nAlso, and conversely, this does not mean that the service has no state or does not modify data, just that the state local to the wen ui service has the same lifecycle as the web ui service (e.g., is not specific to a service request) and that data changes are made in the backend Eucalyptus services.\r\n\r\nPerformance\r\n\r\nstate changes should be reflected w/in the UI w/o user action w/in a timebound that is configurable (not user configurable).\r\nresponsiveness and load times for the UI & UI actions are compatible w/ google apps.\r\n\r\nInteroperability, Modifiability, Extensibility & Customizability\r\n\r\nfuture expansion of functionality: the service's interaction with backend Eucalyptus services has the notion of a single API version is being used and can be upgrade to account for expanded/improved backend functionality.\r\nmodularization and implementation of the UI and proxy server must be constrained to accomodate the need for future additions and modifications:\r\ncohesion: should be modularized according to functional cohesion.\r\ncoupling: functionality corresponding to service operations must be modularized and implemented such that stamp-coupling (data-structure coupling) is an upper bound.\r\ncoupling: implementation should prefer to avoid stamp-coupling except for inherently coupled functionality (e.g., in the domain model – run instances exhibits this characteristic)\r\nui, data, and functional cohesion/binding: service operations and their corresponding implementation elements for ui, data, and function are bound to ui display at run time (e.g., populating menu items dynamically)\r\nParity: a path to feature-parity for the UI and CLI for the corresponding functionality needs to be determined to allow for future co-development of UI, CLI, and service implementation.\r\nCustomizability - The ability for customers to change the theme / color scheme / logo / name / labels / prompt messages (login, error, etc.) needed\r\nnote this does not apply to error messages which are generated by back-end service requests\r\ni18n support: strings and images in the UI should support localization\r\n508-compliance: we should not preclude our ability to be 508-compliant in the future\r\nFuture multi-cloud support: the UI should support a path to expanding support to include control over multiple clouds, but is explicitly excluding a 'switch between clouds' approach.\r\n\r\nTestability\r\n\r\nit must be possible to create automated tests for functionality in the ui.\r\nthe implementation part which communicates with backend Eucalyptus services can be tested independently.\r\nthe implementation part which communicates with backend Eucalyptus services can mocked to allow for synthetic ui testing.\r\nfor features which do not change across versions of the ui tests should not require modification (e.g., separate builds preserve identifiers in the DOM)\r\n\r\nSecurity\r\n\r\nThe application shall verify the identity of all of its users before allowing them to use its capabilities (SCOPE: potentially global, except S3 anonymous request?)\r\nThe application shall allow each user to obtain access to information iff they have sufficient authorization.\r\nWeb UI proxy must canonicalize all user input\r\nThis implies all datatypes used by interfaces exposed to users have a well-defined canonical form.\r\nFor canonicalization to be useful it must be done before any use of the data is made by the application.\r\nThe application shall NOT store permanently any credentials or authentication tokens that it generates/uses/proxies.\r\nThe application shall automatically expire an authenticated user session:\r\nno later than 24hrs after its creation (i.e., maximum session length is 24hrs).\r\nthe expiration period can be configurable\r\nsessions should be logged out after a period of inactivity (implying revocation of the session credentials)\r\nsupport revocation of the authentication token at anytime (i.e., including before the 24hr period)\r\nThe application shall terminate/invalidate an authenticated user session on events such as logout (for example, if we support password change this also applies)\r\nThe application shall protect from unauthorized access any user authentication tokens managed by the client and server providing web UI access\r\non the server-side\r\non the client-side\r\nThe application shall ensure that all valid requests from the client to the web UI server cannot be forged by a malicious party\r\nthe server shall NOT accept requests that the user did not intent to send\r\nthe server shall NOT accept requests that were tampered in transit (this one it probably too strong if https is not a requirement)\r\nThe application shall NOT allow for replay of messages between the web UI client and server\r\nThe application shall validate/sanitize any input data (i.e. data originated/coming from the outside of the processing component) before it's used in a security-sensitive operation (such as, database access, echoing back to the user, DOM access on the client, etc.)\r\n\r\nPortability, Distributability, and Installation\r\n\r\nit must be that the UI installs and deploys as part of a Eucalyptus installation and deployment (i.e. it\r\ndoes not require a separate installation and deployment process).\r\n\r\nit should also be compatible (in terms of dependencies) with the distros supported by Eucalyptus.\r\none shouldn't need to run a specific distro or limited set of distros for the UI only.\r\nthe UI should work with what ever distro Eucalyptus is using in a specific installation.\r\n\r\nPackaging/deployment/updates/sustainability\r\n\r\nPackaging: the ui will be treated like a distinct component and packaged separately while following the guidelines for packaging and distribution as applied to all other open-source components.\r\nit is not part of another component\r\nso, it is packaged and distributed separately (own package)\r\nit is open source so binary deps, proprietary stuff, etc. are unacceptable\r\nthe constraints that everything else has to satisfy in terms of distro inclusion, licensing, build from source, etc must also be complied with\r\nDependency choices for the UI implementation/design must be compatible with the releaseable dependencies of eucalyptus\r\nPENDING: Same versioning scheme as Eucalyptus, i.e., not a separate product.\r\nupdating the ui installation can be done independent of the rest of Eucalyptus\r\nit cannot require an upgrade to other system components\r\nit cannot require a service restart of other system components\r\nLicenses for third-party software should be compatible with GPLv3.\r\nTraining plan for new technology/third party frameworks.","customfield_13000":null,"customfield_13200":null,"customfield_11300":null,"customfield_11500":null,"customfield_11301":null,"customfield_11302":null,"timetracking":{},"customfield_10401":null,"customfield_10005":null,"customfield_10600":null,"customfield_12900":null,"aggregatetimeestimate":null,"attachment":[],"summary":"Eucalyptus User Console","creator":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=tjcramer","name":"tjcramer","key":"tjcramer","accountId":"557058:e076cf45-80ca-4b67-befb-7b0c21f32739","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/65e7a5c18fc469f1978f6367993c3bf0?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FownerId%3Dtjcramer%26avatarId%3D10401%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/65e7a5c18fc469f1978f6367993c3bf0?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26ownerId%3Dtjcramer%26avatarId%3D10401%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/65e7a5c18fc469f1978f6367993c3bf0?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26ownerId%3Dtjcramer%26avatarId%3D10401%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/65e7a5c18fc469f1978f6367993c3bf0?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26ownerId%3Dtjcramer%26avatarId%3D10401%26noRedirect%3Dtrue"},"displayName":"Tim Cramer","active":true,"timeZone":"America/Los_Angeles"},"subtasks":[],"reporter":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=tjcramer","name":"tjcramer","key":"tjcramer","accountId":"557058:e076cf45-80ca-4b67-befb-7b0c21f32739","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/65e7a5c18fc469f1978f6367993c3bf0?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FownerId%3Dtjcramer%26avatarId%3D10401%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/65e7a5c18fc469f1978f6367993c3bf0?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26ownerId%3Dtjcramer%26avatarId%3D10401%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/65e7a5c18fc469f1978f6367993c3bf0?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26ownerId%3Dtjcramer%26avatarId%3D10401%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/65e7a5c18fc469f1978f6367993c3bf0?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26ownerId%3Dtjcramer%26avatarId%3D10401%26noRedirect%3Dtrue"},"displayName":"Tim Cramer","active":true,"timeZone":"America/Los_Angeles"},"customfield_10000":"1_*:*_1_*:*_96264258604_*|*_6_*:*_1_*:*_0","aggregateprogress":{"progress":0,"total":0},"customfield_12100":"0|i01h8n:","customfield_10001":"2013-03-14T19:38:39.278-0500","customfield_10200":null,"customfield_10002":null,"customfield_10003":["UserConsole"],"customfield_10004":null,"customfield_12500":null,"customfield_10400":null,"customfield_10116":null,"customfield_11600":["awithrow(awithrow)","tjcramer(tjcramer)"],"customfield_10117":null,"environment":null,"customfield_11800":null,"customfield_11802":null,"customfield_11805":null,"duedate":null,"customfield_11806":null,"progress":{"progress":0,"total":0},"comment":{"comments":[{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/15054/comment/41648","id":"41648","author":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=awithrow","name":"awithrow","key":"awithrow","accountId":"557058:489310fd-31eb-49f8-8552-e87970faf51b","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/a5a27d1c4012a61174df794fd8406eb5?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/a5a27d1c4012a61174df794fd8406eb5?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/a5a27d1c4012a61174df794fd8406eb5?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/a5a27d1c4012a61174df794fd8406eb5?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"Aaron Withrow","active":false,"timeZone":"America/Los_Angeles"},"body":"Removed the Fix version 3.2.0 as this issue is open and 3.2.0 is released.  ","updateAuthor":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=awithrow","name":"awithrow","key":"awithrow","accountId":"557058:489310fd-31eb-49f8-8552-e87970faf51b","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/a5a27d1c4012a61174df794fd8406eb5?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/a5a27d1c4012a61174df794fd8406eb5?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/a5a27d1c4012a61174df794fd8406eb5?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/a5a27d1c4012a61174df794fd8406eb5?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"Aaron Withrow","active":false,"timeZone":"America/Los_Angeles"},"created":"2013-03-14T19:38:39.278-0500","updated":"2013-03-14T19:38:39.278-0500"}],"maxResults":1,"total":1,"startAt":0},"votes":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-3207/votes","votes":0,"hasVoted":false},"customfield_11808":null,"worklog":{"startAt":0,"maxResults":20,"total":0,"worklogs":[]}}}