{"expand":"renderedFields,names,schema,operations,editmeta,changelog,versionedRepresentations","id":"45418","self":"https://eucalyptus.atlassian.net/rest/api/2/issue/45418","key":"EUCA-12520","fields":{"issuetype":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issuetype/1","id":"1","description":"A problem which impairs or prevents the functions of the product.","iconUrl":"https://eucalyptus.atlassian.net/secure/viewavatar?size=xsmall&avatarId=14803&avatarType=issuetype","name":"Bug","subtask":false,"avatarId":14803},"timespent":null,"customfield_13100":null,"project":{"self":"https://eucalyptus.atlassian.net/rest/api/2/project/10000","id":"10000","key":"EUCA","name":"Eucalyptus","avatarUrls":{"48x48":"https://eucalyptus.atlassian.net/secure/projectavatar?pid=10000&avatarId=10011","24x24":"https://eucalyptus.atlassian.net/secure/projectavatar?size=small&pid=10000&avatarId=10011","16x16":"https://eucalyptus.atlassian.net/secure/projectavatar?size=xsmall&pid=10000&avatarId=10011","32x32":"https://eucalyptus.atlassian.net/secure/projectavatar?size=medium&pid=10000&avatarId=10011"}},"customfield_11000":null,"fixVersions":[],"customfield_11001":null,"aggregatetimespent":null,"customfield_10310":null,"resolution":{"self":"https://eucalyptus.atlassian.net/rest/api/2/resolution/6","id":"6","description":"The product is working as designed.","name":"Not a Bug"},"customfield_11401":null,"customfield_10311":null,"customfield_11400":null,"customfield_10302":null,"customfield_10104":[],"customfield_10500":{"self":"https://eucalyptus.atlassian.net/rest/api/2/customFieldOption/10403","value":"Not Applicable","id":"10403"},"customfield_10105":null,"customfield_10303":null,"customfield_10700":null,"customfield_10304":null,"customfield_10701":null,"customfield_10306":null,"customfield_10702":null,"customfield_10703":null,"customfield_10704":null,"resolutiondate":"2016-06-30T15:29:34.942-0500","customfield_10308":null,"customfield_10309":null,"customfield_10705":null,"workratio":-1,"watches":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12520/watchers","watchCount":1,"isWatching":false},"lastViewed":null,"created":"2016-06-30T15:10:23.654-0500","customfield_12000":null,"customfield_12400":null,"priority":{"self":"https://eucalyptus.atlassian.net/rest/api/2/priority/3","iconUrl":"https://eucalyptus.atlassian.net/images/icons/priorities/major.svg","name":"Major","id":"3"},"customfield_12201":null,"customfield_12600":"{}","customfield_10102":null,"customfield_10300":null,"customfield_10301":null,"labels":[],"customfield_11700":null,"aggregatetimeoriginalestimate":null,"timeestimate":null,"versions":[],"customfield_11901":null,"issuelinks":[],"assignee":null,"updated":"2016-06-30T15:29:34.948-0500","status":{"self":"https://eucalyptus.atlassian.net/rest/api/2/status/6","description":"The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.","iconUrl":"https://eucalyptus.atlassian.net/images/icons/statuses/generic.png","name":"Closed","id":"6","statusCategory":{"self":"https://eucalyptus.atlassian.net/rest/api/2/statuscategory/3","id":3,"key":"done","colorName":"green","name":"Done"}},"components":[],"timeoriginalestimate":null,"description":"\r\n== (((Quickbooks Support))) 1800-860-9230 Quickbooks HelpDesk Support Number QUickbooks Helplines Support Number ==\r\n\r\nUSA ACCOUNTS@1-800-860-9230(( )) QuickBooks Payroll Tech Support Phone Number,QuickBooks Technical Support\r\n\r\n\r\nUSA ACCOUNTS@1-800-860-9230(( )) QuickBooks Payroll Tech Support Phone Number,QuickBooks Technical Support\r\n\r\nDescribe Account Help Intuit.@ ((1-800-860-9230@ QuickBooks tech support number QuickBooks pro 2014 support phone USA, payroll support here.Describe @@Tollfree 1-800-860-9230.++Quickbooks phone number@@ here. +1-800-860-9230..Quickbooks technical support phone number Quickbooks support phone number payroll quickbooks proadvisor login phone number for quickbooks technical support quickbooks phone number for tech support quickbooks payroll phone number quickbooks phone number tech support quickbooks technical support contact number quickbooks online tech support phone number quickbooks error 1603 quickbooks error 1334 quickbooks error -166 quickbooks error code 6660 quickbooks error quickbooks error -1666 quickbooks -6660 error quickbooks - Intuit Quickbooks Toll Free, Intuit@(+1-800-860-9230)@-: Intuit Quickbooks Tech Support Phone Number provides online solution for all USA/CANADA clients. For any help of query call 1 877 to get all Intuit Quickbooks account solution. @@Call, +1-800-860-9230 for all type help by Intuit Quickbooks tech support phone number, Intuit Quickbooks Tech Support Phone Number, Intuit Quickbooks Help Desk Phone Number, Intuit Quickbooks tech support number, Intuit Quickbooks technical support phone number,@@@ Intuit Quickbooks phone number, Intuit Quickbooks technical support number, Intuit Quickbooks support phone number, Intuit Quickbooks technical support, Intuit Quickbooks Customer Service Phone Number, Intuit Quickbooks Customer Service Number, Intuit Quickbooks Customer Support Phone Number, Intuit Quickbooks Customer Support Number,@@@@ Intuit Quickbooks Customer Service Helpline Number, Intuit Quickbooks Customer Care Number, Intuit Quickbooks support team phone number, @@@@@ Intuit Quickbooks help number-Intuit Quickbooks Helpline Number; Intuit Quickbooks help phone number-Intuit Quickbooks Helpline Number, Intuit Quickbooks Tech Support Toll free Number, Intuit Quickbooks Support Telephone Number, Intuit Quickbooks Tech Support Telephone number, Intuit Quickbooks Tech Support contact number, Intuit Quickbooks support contact number, Intuit Quickbooks technical support contact number. Call, Intuit Quickbooks tech support phone number, Intuit Quickbooks Tech Support Phone Number, Intuit Quickbooks Help Desk Phone Number, Intuit Quickbooks tech support number, Intuit Quickbooks technical support phone number, Intuit Quickbooks phone number, Intuit Quickbooks technical support number, Intuit Quickbooks support phone number. It is very popular toll free number which provide by Intuit Quickbooks technical support, Intuit Quickbooks Customer Service Phone Number, Intuit Quickbooks Customer Service Number, Intuit Quickbooks Customer Support Phone Number, Intuit Quickbooks Customer Support Number, Intuit Quickbooks Customer Service Helpline Number, Intuit Quickbooks Customer Care Number, Intuit Quickbooks support team phone number. Call, Intuit Quickbooks tech support phone number, Intuit Quickbooks Tech Support Phone Number, Intuit Quickbooks Help Desk Phone Number, Intuit Quickbooks tech support number, Intuit Quickbooks technical support phone number, Intuit Quickbooks phone number, Intuit Quickbooks technical support number, Intuit Quickbooks support phone number, Intuit Quickbooks technical support, Intuit Quickbooks Customer Service Phone Number, Intuit Quickbooks Customer Service Number, Intuit Quickbooks Customer Support Phone Number, Intuit Quickbooks Customer Support Number, Intuit Quickbooks Customer Service Helpline Number, Intuit Quickbooks Customer Care Number, Intuit Quickbooks support team phone number, Intuit Quickbooks help number-Intuit Quickbooks Helpline Number; Intuit Quickbooks help phone number, Intuit Quickbooks Helpline Number, Intuit Quickbooks Tech Support Toll free Number, Intuit Quickbooks Support Telephone Number, Intuit Quickbooks Tech Support Telephone number, Intuit Quickbooks Tech Support contact number, Intuit Quickbooks support contact number, Intuit Quickbooks technical support contact number, Intuit Quickbooks pro support phone number, Intuit Quickbooks payroll support phone number. Intuit Quickbooks payroll customer support phone Intuit Quickbooks pro Toll Free, Intuit@(+1-800-860-9230)@-: Intuit Quickbooks pro Tech Support Phone Number provides online solution for all USA/CANADA clients. For any help of query call 1 877 to get all Intuit Quickbooks pro account solution. @@Call, +1-800-860-9230 for all type help by Intuit Quickbooks pro tech support phone number, Intuit Quickbooks pro Tech Support Phone Number, Intuit Quickbooks pro Help Desk Phone Number, Intuit Quickbooks pro tech support number, Intuit Quickbooks pro technical support phone number,@@@ Intuit Quickbooks pro phone number, Intuit Quickbooks pro technical support number, Intuit Quickbooks pro support phone number, Intuit Quickbooks pro technical support, Intuit Quickbooks pro Customer Service Phone Number, Intuit Quickbooks pro Customer Service Number, Intuit Quickbooks pro Customer Support Phone Number, Intuit Quickbooks pro Customer Support Number,@@@@ Intuit Quickbooks pro Customer Service Helpline Number, Intuit Quickbooks pro Customer Care Number, Intuit Quickbooks pro support team phone number, @@@@@ Intuit Quickbooks pro help number-Intuit Quickbooks pro Helpline Number; Intuit Quickbooks pro help phone number-Intuit Quickbooks pro Helpline Number, Intuit Quickbooks pro Tech Support Toll free Number, Intuit Quickbooks pro Support Telephone Number, Intuit Quickbooks pro Tech Support Telephone number, Intuit Quickbooks pro Tech Support contact number, Intuit Quickbooks pro support contact number, Intuit Quickbooks pro technical support contact number. Call, Intuit Quickbooks pro tech support phone number, Intuit Quickbooks pro Tech Support Phone Number, Intuit Quickbooks pro Help Desk Phone Number, Intuit Quickbooks pro tech support number, Intuit Quickbooks pro technical support phone number, Intuit Quickbooks pro phone number, Intuit Quickbooks pro technical support number, Intuit Quickbooks pro support phone number. It is very popular toll free number which provide by Intuit Quickbooks pro technical support, Intuit Quickbooks pro Customer Service Phone Number, Intuit Quickbooks pro Customer Service Number, Intuit Quickbooks pro Customer Support Phone Number, Intuit Quickbooks pro Customer Support Number, Intuit Quickbooks pro Customer Service Helpline Number, Intuit Quickbooks pro Customer Care Number, Intuit Quickbooks pro support team phone number. Call, Intuit Quickbooks pro tech support phone number, Intuit Quickbooks pro Tech Support Phone Number, Intuit Quickbooks pro Help Desk Phone Number, Intuit Quickbooks pro tech support number, Intuit Quickbooks pro technical support phone number, Intuit Quickbooks pro phone number, Intuit Quickbooks pro technical support number, Intuit Quickbooks pro support phone number, Intuit Quickbooks pro technical support, Intuit Quickbooks pro Customer Service Phone Number, Intuit Quickbooks pro Customer Service Number, Intuit Quickbooks pro Customer Support Phone Number, Intuit Quickbooks pro Customer Support Number, Intuit Quickbooks pro Customer Service Helpline Number, Intuit Quickbooks pro Customer Care Number, Intuit Quickbooks pro support team phone number, Intuit Quickbooks pro help number-Intuit Quickbooks pro Helpline Number; Intuit Quickbooks pro help phone number, Intuit Quickbooks pro Helpline Number, Intuit Quickbooks pro Tech Support Toll free + 1-800-860-9230 Number, Intuit Quickbooks pro Support Telephone Number, Intuit Quickbooks pro Tech Support Telephone number, Intuit Quickbooks pro Tech Support contact number, Intuit Quickbooks pro support contact number, Intuit Quickbooks pro technical support contact number, Intuit Quickbooks pro pro support phone number, Intuit Quickbooks pro payroll support phone number. Intuit Quickbooks pro payroll customer support phone Supported Services:- Call +1-800-860-9230.(((((quickbooks error message Call +1-800-860-9230.(((((quickbooks error 6177 Call +1-800-860-9230.(((((quickbooks error 6129 Call +1-800-860-9230.(((((quickbooks error 6660 Call +1-800-860-9230.(((((quickbooks enterprise 2015 support Call +1-800-860-9230.(((((quickbooks enterprise to online Call +1-800-860-9230.(((((intuit support phone number quickbooks Call +1-800-860-9230.(((((quickbooks contact support phone number Call +1-800-860-9230.(((((quickbooks usa support phone number Call +1-800-860-9230.(((((quickbooks desktop support number Call +1-800-860-9230.(((((quickbooks technical number Call +1-800-860-9230.(((((quickbook technical support number Call +1-800-860-9230.(((((intuit quickbooks tech support number Call +1-800-860-9230.(((((quickbooks payroll not updating Call +1-800-860-9230.(((((quickbooks not opening Call +1-800-860-9230((((((..Quickbooks Customer Support Phone Number Call +1-800-860-9230((((((..Quickbooks Technical Support Phone Number Call +1-800-860-9230((((((..Quickbooks Tech Support Phone Number Call +1-800-860-9230((((((..Quickbooks Support Phone Number Call +1-800-860-9230((((((..Quickbooks Phone Number Call +1-800-860-9230((((((..Quickbooks Payroll Customer Care Number Quickbooks tech supportQuickbooks Tech Support Phone Number USA Quickbooks Technical Support phone Number Quickbooks support phone number Quickbooks support phone number USA Quickbooks technical support number USA Quickbooks tech support telephone number Quickbooks help phone numberIntuit technical support phone number Quickbooks customer support number Quickbook tech support phone number Intuit Quickbooks tech support phone number Quickbooks enterprise support phone number Quickbooks component repair tool for windows xp/vista/7 Quickbooks not connecting to internet Quickbooks unsupported system configuration Dealing some random error message installing Quickbooks Quickbooks Data export or import issues Quickbooks failed to make an internet connection Quickbooks multi user mode not syncing Quickbooks not opening in multi-user modeQuickbooks payroll support phone number Showing error while updating company data file in Quickbooks How to restore Quickbooks auto data recovery Quickbooks Connection Problem and connection configuration Quickbooks Installation Support Phone Number Quickbooks Company File Not Opening in Multi User Mode Quickbooks Keeps Disconnecting From Server Quickbooks Error Message Server Busy Quickbooks Payroll Tech Support Phone Number Quickbooks Data File Needs To Be Updated Quickbooks Data File Recovery Extention Quickbooks connection has been lostQuickbooks Installation Error 1722,1334,15215&1904 Quickbooks error code 6660,3371 Quickbooks error code message H-303 & H-202 Account Help Intuit.@ ((1-800-860-9230@ QuickBooks tech support number QuickBooks pro 2014 support phone USA, payroll support\r\n","customfield_13000":null,"customfield_13200":null,"customfield_11300":null,"customfield_11500":null,"timetracking":{},"customfield_10401":null,"customfield_10005":null,"customfield_10600":null,"customfield_12900":null,"aggregatetimeestimate":null,"attachment":[],"summary":"QQRT...Quickbooks...1-800-860-9230...Quickbooks Tech Support Phone Number","creator":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=brijwasipitt","name":"brijwasipitt","key":"brijwasipitt","accountId":"557058:6eba3fa6-0afe-4f54-a0d7-b2d239e6dd7a","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"Pitt Brijwasi","active":false,"timeZone":"US/Central"},"subtasks":[],"reporter":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=brijwasipitt","name":"brijwasipitt","key":"brijwasipitt","accountId":"557058:6eba3fa6-0afe-4f54-a0d7-b2d239e6dd7a","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"Pitt Brijwasi","active":false,"timeZone":"US/Central"},"customfield_12100":"0|i03ufb:","aggregateprogress":{"progress":0,"total":0},"customfield_10000":"6_*:*_1_*:*_0_*|*_10000_*:*_1_*:*_1151296","customfield_10001":null,"customfield_10002":null,"customfield_10200":null,"customfield_10003":null,"customfield_10400":null,"customfield_12500":null,"customfield_10116":null,"customfield_11600":["brijwasipitt(brijwasipitt)"],"customfield_10117":null,"environment":null,"customfield_11800":null,"customfield_11802":null,"customfield_11805":null,"duedate":null,"customfield_11806":null,"progress":{"progress":0,"total":0},"comment":{"comments":[],"maxResults":0,"total":0,"startAt":0},"votes":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12520/votes","votes":0,"hasVoted":false},"worklog":{"startAt":0,"maxResults":20,"total":0,"worklogs":[]},"customfield_11808":null}}