{"expand":"renderedFields,names,schema,operations,editmeta,changelog,versionedRepresentations","id":"45426","self":"https://eucalyptus.atlassian.net/rest/api/2/issue/45426","key":"EUCA-12528","fields":{"issuetype":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issuetype/1","id":"1","description":"A problem which impairs or prevents the functions of the product.","iconUrl":"https://eucalyptus.atlassian.net/secure/viewavatar?size=xsmall&avatarId=14803&avatarType=issuetype","name":"Bug","subtask":false,"avatarId":14803},"timespent":null,"customfield_13100":null,"project":{"self":"https://eucalyptus.atlassian.net/rest/api/2/project/10000","id":"10000","key":"EUCA","name":"Eucalyptus","avatarUrls":{"48x48":"https://eucalyptus.atlassian.net/secure/projectavatar?pid=10000&avatarId=10011","24x24":"https://eucalyptus.atlassian.net/secure/projectavatar?size=small&pid=10000&avatarId=10011","16x16":"https://eucalyptus.atlassian.net/secure/projectavatar?size=xsmall&pid=10000&avatarId=10011","32x32":"https://eucalyptus.atlassian.net/secure/projectavatar?size=medium&pid=10000&avatarId=10011"}},"customfield_11000":null,"fixVersions":[],"customfield_11001":null,"aggregatetimespent":null,"resolution":{"self":"https://eucalyptus.atlassian.net/rest/api/2/resolution/6","id":"6","description":"The product is working as designed.","name":"Not a Bug"},"customfield_10310":null,"customfield_10311":null,"customfield_11401":null,"customfield_11400":null,"customfield_10302":null,"customfield_10500":{"self":"https://eucalyptus.atlassian.net/rest/api/2/customFieldOption/10403","value":"Not Applicable","id":"10403"},"customfield_10104":[],"customfield_10303":null,"customfield_10105":null,"customfield_10700":null,"customfield_10304":null,"customfield_10701":null,"customfield_10306":null,"customfield_10702":null,"customfield_10703":null,"resolutiondate":"2016-06-30T15:23:02.570-0500","customfield_10308":null,"customfield_10704":null,"customfield_10705":null,"customfield_10309":null,"workratio":-1,"lastViewed":null,"watches":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12528/watchers","watchCount":1,"isWatching":false},"created":"2016-06-30T15:18:37.496-0500","customfield_12000":null,"customfield_12400":null,"priority":{"self":"https://eucalyptus.atlassian.net/rest/api/2/priority/3","iconUrl":"https://eucalyptus.atlassian.net/images/icons/priorities/major.svg","name":"Major","id":"3"},"customfield_12201":null,"customfield_12600":"{}","customfield_10102":null,"customfield_10300":null,"labels":[],"customfield_10301":null,"customfield_11700":null,"aggregatetimeoriginalestimate":null,"timeestimate":null,"customfield_11901":null,"versions":[],"issuelinks":[],"assignee":null,"updated":"2016-06-30T15:23:02.577-0500","status":{"self":"https://eucalyptus.atlassian.net/rest/api/2/status/6","description":"The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.","iconUrl":"https://eucalyptus.atlassian.net/images/icons/statuses/generic.png","name":"Closed","id":"6","statusCategory":{"self":"https://eucalyptus.atlassian.net/rest/api/2/statuscategory/3","id":3,"key":"done","colorName":"green","name":"Done"}},"components":[],"timeoriginalestimate":null,"customfield_13000":null,"description":"Intuit@(1-800-860-9230)Quickbooks POS Tech Support Phone NumberIntuit@(1-800-860-9230)Quickbooks POS Tech Support Phone Number provides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all Quickbooks POS account solution. @@Call, 1-800-860-9230 for all type help by Quickbooks POS tech support phone number, Intuit Quickbooks POS Tech Support Phone Number, Quickbooks POS Help Desk Phone Number, Quickbooks POS tech support number, Quickbooks POS technical support phone number,@@@ Quickbooks POS phone number, Quickbooks POS technical support number, Quickbooks POS support phone number, Quickbooks POS technical support, Quickbooks POS Customer Service Phone Number, Quickbooks POS Customer Service Number, Quickbooks POS Customer Support Phone Number, Quickbooks POS Customer Support Number,@@@@ Quickbooks POS Customer Service Helpline Number, Quickbooks POS Customer Care Number, Quickbooks POS support team phone number, @@@@@ Quickbooks POS help number-Quickbooks POS Helpline Number; Quickbooks POS help phone number-Quickbooks POS Helpline Number, Quickbooks POS Tech Support Toll free Number, Quickbooks POS Support Telephone Number, Quickbooks POS Tech Support Telephone number, Quickbooks POS Tech Support contact number, Quickbooks POS support contact number, Quickbooks POS technical support contact number. Call, Quickbooks POS tech support phone number, Intuit Quickbooks POS Tech Support Phone Number, Quickbooks POS Help Desk Phone Number, Quickbooks POS tech support number, Quickbooks POS technical support phone number, Quickbooks POS phone number, Quickbooks POS technical support number, Quickbooks POS support phone number. It is very popular toll free number which provide by Quickbooks POS technical support, Quickbooks POS Customer Service Phone Number, Quickbooks POS Customer Service Number, Quickbooks POS Customer Support Phone Number, Quickbooks POS Customer Support Number, Quickbooks POS Customer Service Helpline Number, Quickbooks POS Customer Care Number, Quickbooks POS support team phone number. Call, Quickbooks POS tech support phone number, Intuit Quickbooks POS Tech Support Phone Number, Quickbooks POS Help Desk Phone Number, Quickbooks POS tech support number, Quickbooks POS technical support phone number, Quickbooks POS phone number, Quickbooks POS technical support number, Quickbooks POS support phone number, Quickbooks POS technical support, Quickbooks POS Customer Service Phone Number, Quickbooks POS Customer Service Number, Quickbooks POS Customer Support Phone Number, Quickbooks POS Customer Support Number, Quickbooks POS Customer Service Helpline Number, Quickbooks POS Customer Care Number, Quickbooks POS support team phone number, Quickbooks POS help number-Quickbooks POS Helpline Number; Quickbooks POS help phone number, Quickbooks POS Helpline Number, Quickbooks POS Tech Support Toll free Number, Quickbooks POS Support Telephone Number, Quickbooks POS Tech Support Telephone number, Quickbooks POS Tech Support contact number, Quickbooks POS support contact number, Quickbooks POS technical support contact number, Quickbooks POS pro support phone number, Quickbooks POS POS support phone number. Quickbooks POS POS customer support phone number Quickbooks POS Support Helpline Number, Quickbooks POS contact number Quickbooks POS tech support phone number Quickbooks POS support team phone number Quickbooks POS contact number 1800-860-9230 Quickbooks POS technical help telephone number, Quickbooks POS technical help contact number, Quickbooks POS technical support contact number, Quickbooks POS contact number, Quickbooks POS contact phone number, Quickbooks POS contact telephone number, Quickbooks POS 24 hour contact number, Quickbooks POS customer support contact number, Quickbooks POS customer service contact number, Quickbooks POS official number, Quickbooks POS official contact number, Quickbooks POS 800 contact number, Quickbooks POS toll free number, 800 number for Quickbooks POS support, Quickbooks POS 24/7 support phone number Quickbooks POS PRO support phone number,Quickbooks POS PRO support phone number,Quickbooks POS PRO help phone number, Quickbooks POS PRO technical support number.Quickbooks POS PRO support number, Quickbooks POS PRO phone number, Quickbooks POS PRO tech support number, Quickbooks POS PRO customer support number, Quickbooks POS PRO customer support phone number, Quickbooks POS PRO customer service phone number, Quickbooks POS PRO POS customer service phone number, Quickbooks POS PRO support phone number. Help@Call 1-800-860-9230/.Quickbooks POS 24/7 support phone number,Quickbooks POS telephone number for support? call 1800-860-9230@./Quickbooks POS contact number, Quickbooks POS contact phone number, Quickbooks POS contact telephone number,,telephone number for Quickbooks POS online support,Quickbooks POS official support number,Quickbooks POS official number,Quickbooks POS POS official phone number,,,phone number for Quickbooks POS POS support,,Quickbooks POS 24/7 support phone number,,Quickbooks POS support number,Quickbooks POS telephone number for support .................. Quickbooks POS PRO phone number,(1-800-860-9230)// Quickbooks POS PRO customer care number..... Quickbooks POS PRO Toll Free, Intuit@(1-800.860-9230)@-: Quickbooks POS PRO Technical Support Number, Quickbooks POS PRO help desk phone number provides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all Quickbooks POS PRO account solution. For any help of query call 1 800 860 9230 to get all Quickbooks POS PRO account solution. @@Call, 1-800-860-9230 for all type help by Quickbooks POS PRO support telephone number,Quickbooks POS PRO support phone number,Quickbooks POS PRO support phone number,Quickbooks POS PRO help phone number, Quickbooks POS PRO technical support number.Quickbooks POS PRO support number, Quickbooks POS PRO phone number, Quickbooks POS PRO tech support number, Quickbooks POS PRO customer support number, Quickbooks POS PRO customer support phone number, Quickbooks POS PRO customer service phone number, Quickbooks POS PRO POS customer service phone number, Quickbooks POS PRO support phone number Quickbooks POS PRO help number-Quickbooks POS PRO Helpline Number; Quickbooks POS PRO help phone number-Quickbooks POS PRO Helpline Number, Quickbooks POS PRO Tech Support Toll free Number, Quickbooks POS PRO Support Telephone Number, Quickbooks POS PRO Tech Support Telephone number, Quickbooks POS PRO Tech Support contact number, Quickbooks POS PRO support contact number, Quickbooks POS PRO technical support contact number, Quickbooks POS PRO help desk phone number. Call, @(1-800-860-9230)@-: It is very popular toll free number which provide by Quickbooks POS PRO technical support, Quickbooks POS PRO Customer Service Phone Number, Quickbooks POS PRO Customer Service Number, Quickbooks POS PRO Customer Support Phone Number, Quickbooks POS PRO Customer Support Number, Quickbooks POS PRO Customer Service Helpline Number, Quickbooks POS PRO Customer Care Number, Quickbooks POS PRO support team phone number. Call,@(1-800-860-9230)@-: Quickbooks POS PRO help number-Quickbooks POS PRO Helpline Number; Quickbooks POS PRO help phone number, Quickbooks POS PRO Helpline Number, Quickbooks POS PRO Tech Support Toll free Number, Quickbooks POS PRO Support Telephone Number, Quickbooks POS PRO Tech Support Telephone number, Quickbooks POS PRO Tech Support contact number, Quickbooks POS PRO support contact number, Quickbooks POS PRO technical support contact number, Quickbooks POS PRO pro support phone number, Quickbooks POS PRO POS support phone number. Quickbooks POS PRO POS customer support phone number for all type help by Quickbooks POS PRO support telephone number, Quickbooks POS PRO help phone number, Quickbooks POS PRO technical support number.Quickbooks POS PRO support number, Quickbooks POS PRO phone number, Quickbooks POS PRO tech support number, Quickbooks POS PRO customer support number, Quickbooks POS PRO customer support phone number, Quickbooks POS PRO customer service phone number, Quickbooks POS PRO POS customer service phone number Intuit@(1-800-860-9230)Quickbooks POS Tech Support Phone Number provides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all Quickbooks POS account solution. @@Call, 1-800-860-9230 for all type help by Quickbooks POS tech support phone number, Intuit Quickbooks POS Tech Support Phone Number, Quickbooks POS Help Desk Phone Number, Quickbooks POS tech support number, Quickbooks POS technical support phone number,@@@ Quickbooks POS phone number, Quickbooks POS technical support number, Quickbooks POS support phone number, Quickbooks POS technical support, Quickbooks POS Customer Service Phone Number, Quickbooks POS Customer Service Number, Quickbooks POS Customer Support Phone Number, Quickbooks POS Customer Support Number,@@@@ Quickbooks POS Customer Service Helpline Number, Quickbooks POS Customer Care Number, Quickbooks POS support team phone number, @@@@@ Quickbooks POS help number-Quickbooks POS Helpline Number; Quickbooks POS help phone number-Quickbooks POS Helpline Number, Quickbooks POS Tech Support Toll free Number, Quickbooks POS Support Telephone Number, Quickbooks POS Tech Support Telephone number, Quickbooks POS Tech Support contact number, Quickbooks POS support contact number, Quickbooks POS technical support contact number. Call, Quickbooks POS tech support phone number, Intuit Quickbooks POS Tech Support Phone Number, Quickbooks POS Help Desk Phone Number, Quickbooks POS tech support number, Quickbooks POS technical support phone number, Quickbooks POS phone number, Quickbooks POS technical support number, Quickbooks POS support phone number. It is very popular toll free number which provide by Quickbooks POS technical support, Quickbooks POS Customer Service Phone Number, Quickbooks POS Customer Service Number, Quickbooks POS Customer Support Phone Number, Quickbooks POS Customer Support Number, Quickbooks POS Customer Service Helpline Number, Quickbooks POS Customer Care Number, Quickbooks POS support team phone number. Call, Quickbooks POS tech support phone number, Intuit Quickbooks POS Tech Support Phone Number, Quickbooks POS Help Desk Phone Number, Quickbooks POS tech support number, Quickbooks POS technical suppo@@Call, 1-800-860-9230 for all type help by QuickBooks ?? tech support phone number, Intuit QuickBooks ?? Tech Support Phone Number, QuickBooks ?? Help Desk Phone Number, QuickBooks ?? tech support number, QuickBooks ?? technical support phone number,@@@ QuickBooks ?? phone number, QuickBooks ?? technical support number, QuickBooks ?? support phone number, QuickBooks ?? technical support, QuickBooks ?? Customer Service Phone Number, QuickBooks ?? Customer Service Number, QuickBooks ?? Customer Support Phone Number, QuickBooks ?? Customer Support Number,@@@@ QuickBooks ?? Customer Service Helpline Number, QuickBooks ?? Customer Care Number, QuickBooks ?? support team phone number, @@@@@ QuickBooks ?? help number-QuickBooks ?? Helpline Number; QuickBooks ?? help phone number-QuickBooks ?? Helpline Number, QuickBooks ?? Tech Support Toll free Number, QuickBooks ?? Support Telephone Number, QuickBooks ?? Tech Support Telephone number, QuickBooks ?? Tech Support contact number, QuickBooks ?? support contact number, QuickBooks ?? technical support contact number. Call, QuickBooks ?? tech support phone number, Intuit QuickBooks ?? Tech Support Phone Number, QuickBooks ?? Help Desk Phone Number, QuickBooks ?? tech support number, QuickBooks ?? technical support phone number, QuickBooks ?? phone number, QuickBooks ?? technical support number, QuickBooks ?? support phone number. It is very popular toll free number which provide by QuickBooks ?? technical support, QuickBooks ?? Customer Service Phone Number, QuickBooks ?? Customer Service Number, QuickBooks ?? Customer Support Phone Number, QuickBooks ?? Customer Support Number, QuickBooks ?? Customer Service Helpline Number, QuickBooks ?? Customer Care Number, QuickBooks ?? support team phone number. Call, QuickBooks ?? tech support phone number, Intuit QuickBooks ?? Tech Support Phone Number, QuickBooks ?? Help Desk Phone Number, QuickBooks ?? tech support number, QuickBooks ?? technical support phone number, QuickBooks ?? phone number, QuickBooks ?? technical support number, QuickBooks ?? support phone number, QuickBooks ?? technical support, QuickBooks ?? Customer Service Phone Number, QuickBooks ?? Customer Service Number, QuickBooks ?? Customer Support Phone Number, QuickBooks ?? Customer Support Number, QuickBooks ?? Customer Service Helpline Number, QuickBooks ?? Customer Care Number, QuickBooks ?? support team phone number, QuickBooks ?? help number-QuickBooks ?? Helpline Number; QuickBooks ?? help phone number, QuickBooks ?? Helpline Number, QuickBooks ?? Tech Support Toll free Number, QuickBooks ?? Support Telephone Number, QuickBooks ?? Tech Support Telephone number, QuickBooks ?? Tech Support contact number, QuickBooks ?? support contact number, QuickBooks ?? technical support contact number, QuickBooks pro support phone number, QuickBooks support phone number. QuickBooks customer support phone number QuickBooks ?? Support Helpline Number, QuickBooks ?? contact number QuickBooks ?? tech support phone number\r\n\r\nQuickBooks ?? support team phone number\r\n\r\nQuickBooks ?? contact number 1800-860-9230 QuickBooks technical help telephone number, QuickBooks technical help contact number, QuickBooks technical support contact number, QuickBooks contact number, QuickBooks contact phone number, QuickBooks contact telephone number, QuickBooks 24 hour contact number, QuickBooks customer support contact number, QuickBooks customer service contact number, QuickBooks official number, QuickBooks official contact number, QuickBooks 800 contact number, QuickBooks toll free number, 800 number for QuickBooks support, QuickBooks 24/7 support phone number QuickBooks ?? PRO support phone number,QuickBooks ?? PRO support phone number,QuickBooks ?? PRO help phone number, QuickBooks ?? PRO technical support number.QuickBooks ?? PRO support number, QuickBooks ?? PRO phone number, QuickBooks ?? PRO tech support number, QuickBooks ?? PRO customer support number, QuickBooks ?? PRO customer support phone number, QuickBooks ?? PRO customer service phone number, QuickBooks ?? PRO customer service phone number, QuickBooks ?? PRO support phone number.\r\n\r\nHelp@Call 1-800-860-9230/.QuickBooks 24/7 support phone number,QuickBooks telephone number for support? call 1800-860-9230@./QuickBooks contact number, QuickBooks contact phone number, QuickBooks contact telephone numbertelephone number for QuickBooks online support,QuickBooks official support number,QuickBooks official number,QuickBooks official phone number,phone number for QuickBooks supportQuickBooks 24/7 support phone numberQuickBooks support number,QuickBooks telephone number for support\r\n\r\n..................\r\n\r\nQuickBooks ?? PRO phone number,(1-800-860-9230) QuickBooks ?? PRO customer care number..... QuickBooks ?? PRO Toll Free, Intuit@(1-800.860-9230)@-: QuickBooks ?? PRO Technical Support Number, QuickBooks ?? PRO help desk phone number provides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all QuickBooks ?? PRO account solution. For any help of query call 1 800 860 9230 to get all QuickBooks ?? PRO account solution. @@Call, 1-800-860-9230 for all type help by QuickBooks ?? PRO support telephone number,QuickBooks ?? PRO support phone number,QuickBooks ?? PRO support phone number,QuickBooks ?? PRO help phone number, QuickBooks ?? PRO technical support number.QuickBooks ?? PRO support number, QuickBooks ?? PRO phone number, QuickBooks ?? PRO tech support number, QuickBooks ?? PRO customer support number, QuickBooks ?? PRO customer support phone number, QuickBooks ?? PRO customer service phone number,\r\n\r\nIntuit@(1-800-860-9230)Quickbooks PAyroll Tech Support Phone Number provides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all Quickbooks PAyroll account solution. @@Call, 1-800-860-9230 for all type help by Quickbooks PAyroll tech support phone number, Intuit Quickbooks PAyroll Tech Support Phone Number, Quickbooks PAyroll Help Desk Phone Number, Quickbooks PAyroll tech support number, Quickbooks PAyroll technical support phone number,@@@ Quickbooks PAyroll phone number, Quickbooks PAyroll technical support number, Quickbooks PAyroll support phone number, Quickbooks PAyroll technical support, Quickbooks PAyroll Customer Service Phone Number, Quickbooks PAyroll Customer Service Number, Quickbooks PAyroll Customer Support Phone Number, Quickbooks PAyroll Customer Support Number,@@@@ Quickbooks PAyroll Customer Service Helpline Number, Quickbooks PAyroll Customer Care Number, Quickbooks PAyroll support team phone number,\r\n\r\nIntuit@(1-800-860-9230)Quickbooks Enterprise Tech Support Phone Number provides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all Quickbooks Enterprise account solution. @@Call, 1-800-860-9230 for all type help by Quickbooks Enterprise tech support phone number, Intuit Quickbooks Enterprise Tech Support Phone Number, Quickbooks Enterprise Help Desk Phone Number, Quickbooks Enterprise tech support number, Quickbooks Enterprise technical support phone number,@@@ Quickbooks Enterprise phone number, Quickbooks Enterprise technical support number, Quickbooks Enterprise support phone number, Quickbooks Enterprise technical support, Quickbooks Enterprise Customer Service Phone Number, Quickbooks Enterprise Customer Service Number, Quickbooks Enterprise Customer Support Phone Number, Quickbooks Enterprise Customer Support Number,@@@@ Quickbooks Enterprise Customer Service Helpline Number, Quickbooks Enterprise Customer Care Number, Quickbooks Enterprise support team phone number,\r\n\r\nIntuit@(1-800-860-9230)Quickbooks PREMIer Tech Support Phone Number provides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all Quickbooks PREMIer account solution. @@Call, 1-800-860-9230 for all type help by Quickbooks PREMIer tech support phone number, Intuit Quickbooks PREMIer Tech Support Phone Number, Quickbooks PREMIer Help Desk Phone Number, Quickbooks PREMIer tech support number, Quickbooks PREMIer technical support phone number, ","customfield_13200":null,"customfield_11300":null,"customfield_11500":null,"timetracking":{},"customfield_10401":null,"customfield_10005":null,"customfield_10600":null,"customfield_12900":null,"attachment":[],"aggregatetimeestimate":null,"summary":"Help@@(~)1.800.860.9230(@@)QuickBooks Help desk Phone Number Quickbooks Phone number","creator":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=millerjuliabel","name":"millerjuliabel","key":"millerjuliabel","accountId":"557058:b54e83a2-18db-4800-af79-165894da0c91","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"julia miller","active":false,"timeZone":"US/Central"},"subtasks":[],"reporter":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=millerjuliabel","name":"millerjuliabel","key":"millerjuliabel","accountId":"557058:b54e83a2-18db-4800-af79-165894da0c91","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"julia miller","active":false,"timeZone":"US/Central"},"customfield_10000":"6_*:*_1_*:*_0_*|*_10000_*:*_1_*:*_265082","aggregateprogress":{"progress":0,"total":0},"customfield_12100":"0|i03uh3:","customfield_10001":null,"customfield_10200":null,"customfield_10002":null,"customfield_10003":null,"customfield_12500":null,"customfield_10400":null,"customfield_10116":null,"customfield_11600":["millerjuliabel(millerjuliabel)"],"customfield_10117":null,"environment":null,"customfield_11800":null,"customfield_11802":null,"customfield_11805":null,"duedate":null,"customfield_11806":null,"progress":{"progress":0,"total":0},"comment":{"comments":[],"maxResults":0,"total":0,"startAt":0},"votes":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12528/votes","votes":0,"hasVoted":false},"customfield_11808":null,"worklog":{"startAt":0,"maxResults":20,"total":0,"worklogs":[]}}}