{"expand":"renderedFields,names,schema,operations,editmeta,changelog,versionedRepresentations","id":"45423","self":"https://eucalyptus.atlassian.net/rest/api/2/issue/45423","key":"EUCA-12525","fields":{"issuetype":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issuetype/1","id":"1","description":"A problem which impairs or prevents the functions of the product.","iconUrl":"https://eucalyptus.atlassian.net/secure/viewavatar?size=xsmall&avatarId=14803&avatarType=issuetype","name":"Bug","subtask":false,"avatarId":14803},"timespent":null,"customfield_13100":null,"project":{"self":"https://eucalyptus.atlassian.net/rest/api/2/project/10000","id":"10000","key":"EUCA","name":"Eucalyptus","avatarUrls":{"48x48":"https://eucalyptus.atlassian.net/secure/projectavatar?pid=10000&avatarId=10011","24x24":"https://eucalyptus.atlassian.net/secure/projectavatar?size=small&pid=10000&avatarId=10011","16x16":"https://eucalyptus.atlassian.net/secure/projectavatar?size=xsmall&pid=10000&avatarId=10011","32x32":"https://eucalyptus.atlassian.net/secure/projectavatar?size=medium&pid=10000&avatarId=10011"}},"customfield_11000":null,"customfield_11001":null,"fixVersions":[],"aggregatetimespent":null,"customfield_10310":null,"resolution":{"self":"https://eucalyptus.atlassian.net/rest/api/2/resolution/6","id":"6","description":"The product is working as designed.","name":"Not a Bug"},"customfield_11401":null,"customfield_10311":null,"customfield_11400":null,"customfield_10302":null,"customfield_10104":[],"customfield_10500":{"self":"https://eucalyptus.atlassian.net/rest/api/2/customFieldOption/10403","value":"Not Applicable","id":"10403"},"customfield_10105":null,"customfield_10303":null,"customfield_10700":null,"customfield_10304":null,"customfield_10701":null,"customfield_10702":null,"customfield_10306":null,"customfield_10703":null,"customfield_10704":null,"resolutiondate":"2016-06-30T15:28:33.507-0500","customfield_10308":null,"customfield_10309":null,"customfield_10705":null,"workratio":-1,"watches":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12525/watchers","watchCount":1,"isWatching":false},"lastViewed":null,"created":"2016-06-30T15:15:00.411-0500","customfield_12000":null,"priority":{"self":"https://eucalyptus.atlassian.net/rest/api/2/priority/3","iconUrl":"https://eucalyptus.atlassian.net/images/icons/priorities/major.svg","name":"Major","id":"3"},"customfield_12400":null,"customfield_12201":null,"customfield_10300":null,"customfield_10102":null,"customfield_12600":"{}","labels":[],"customfield_10301":null,"customfield_11700":null,"aggregatetimeoriginalestimate":null,"timeestimate":null,"customfield_11901":null,"versions":[],"issuelinks":[],"assignee":null,"updated":"2016-06-30T15:28:33.515-0500","status":{"self":"https://eucalyptus.atlassian.net/rest/api/2/status/6","description":"The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.","iconUrl":"https://eucalyptus.atlassian.net/images/icons/statuses/generic.png","name":"Closed","id":"6","statusCategory":{"self":"https://eucalyptus.atlassian.net/rest/api/2/statuscategory/3","id":3,"key":"done","colorName":"green","name":"Done"}},"components":[],"timeoriginalestimate":null,"customfield_13000":null,"description":"QPML +ยฆ$รท1800-860-9230 quickbooks technical help phone number, quickbooks technical help contact number, quickbooks technical support contact number, quickbooks contact number, quickbooks contact phone number, quickbooks contact telephone number, quickbooks 24 hour contact number, quickbooks customer support contact number, quickbooks customer service contact number, quickbooks official number, quickbooks official contact number, quickbooks 800 contact number, quickbooks toll free number, 800 number for quickbooks support, quickbooks 24/7 support phone number QuickBooks support phone number,QuickBooks support phone number,QuickBooks help phone number, QuickBooks technical support number.QuickBooks support number, QuickBooks phone number, QuickBooks HELP DESK number, QuickBooks customer support number, QuickBooks customer support phone number, QuickBooks customer service phone number, QuickBooks customer service phone number, QuickBooks support phone number. Help@Call 1-800-860-9230/.quickbooks 24/7 support phone number,quickbooks telephone number for support? call 1800-860-9230@./quickbooks contact number, quickbooks contact phone number, quickbooks contact telephone number,,telephone number for quickbooks online support,quickbooks official support number,quickbooks official number,quickbooks official phone number,,,phone number for quickbooks support,,quickbooks 24/7 support phone number,,quickbooks support number,quickbooks telephone number for support QB SUPPORT ON ((1-800-860-9230)) QUICKBOOKS PHONE NUMBER AND QUICKBOOKS SUPPORT PHONE NUMBER Online Support For (((1+800+860+9230)!!! QuickBooks ((Technical)) Support phone number,, QuickBooks HELP DESK phone number Online Support For (((1+800+860+9230)!!! QuickBooks ((Technical)) Support phone number,, QuickBooks HELP DESK phone number Helpline TECH ))1-800-860-9230((QuickBooks technical support phone number QuickBooks phone number QB SUPPORT ON ((1-800-860-9230)) QUICKBOOKS PHONE NUMBER AND QUICKBOOKS SUPPORT PHONE NUMBER QuickBooks Toll Free, Intuit@(1-800-860-9230)@ QuickBooks HELP DESK Phone Number vides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all QuickBooks account solution. @@Call, 1-800-860-9230 for all type help by QuickBooks HELP DESK phone number, Intuit QuickBooks HELP DESK Phone Number, QuickBooks Help Desk Phone Number, QuickBooks HELP DESK number, QuickBooks technical support phone number,@@@ QuickBooks phone number, QuickBooks technical support number, QuickBooks support phone number, QuickBooks technical support, QuickBooks Customer Service Phone Number, QuickBooks Customer Service Number, QuickBooks Customer Support Phone Number, QuickBooks Customer Support Number,@@@@ QuickBooks Customer Service Helpline Number, QuickBooks Customer Care Number, QuickBooks support team phone number, @@@@@ QuickBooks help number-QuickBooks Helpline Number; QuickBooks help phone number-QuickBooks Helpline Number, QuickBooks HELP DESK Toll free Number, QuickBooks Support Telephone Number, QuickBooks HELP DESK Telephone number, QuickBooks HELP DESK contact number, QuickBooks support contact number, QuickBooks technical support contact number. Helpline TECH ))1-800+860+9230(( Quickbooks Enterprise technical support phone number 1-800+860+9230 Quickbooks Enterprise POS phone number 1800+860+9230 QB SUPPORT ON ((1-800+860+9230)) Quickbooks Enterprise PHONE NUMBER AND Quickbooks Enterprise SUPPORT PHONE NUMBER Quickbooks Enterprise Toll Free, Intuit@(1-800+860+9230)@ Quickbooks Enterprise Tech Support Phone Number POSvides online solution for all USA/CANADA clients. For any help of query call 1 800+860+9230 to get all Quickbooks Enterprise account solution. @@Call, 1-800+860+9230 for all type help by Quickbooks Enterprise tech support phone number, Intuit Quickbooks Enterprise Tech Support Phone Number, Quickbooks Enterprise Help Desk Phone Number, Quickbooks Enterprise tech support number, Quickbooks Enterprise technical support phone number,@@@ Quickbooks Enterprise phone number, Quickbooks Enterprise technical support number, Quickbooks Enterprise support phone number, Quickbooks Enterprise technical support, Quickbooks Enterprise Customer Service Phone Number, Quickbooks Enterprise Customer Service Number, Quickbooks Enterprise Customer Support Phone Number, Quickbooks Enterprise Customer Support Number,@@@@ Quickbooks Enterprise Customer Service Helpline Number, Quickbooks Enterprise Customer Care Number, Quickbooks Enterprise support team phone number, @@@@@ Quickbooks Enterprise help number- Quickbooks Enterprise Helpline Number; Quickbooks Enterprise help phone number- Quickbooks Enterprise Helpline Number, Quickbooks Enterprise Tech Support Toll free Number, Quickbooks Enterprise Support Telephone Number, Quickbooks Enterprise Tech Support Telephone number, Quickbooks Enterprise Tech Support contact number, Quickbooks Enterprise support contact number, Quickbooks Enterprise technical support contact number. Call, Quickbooks Enterprise tech support phone number, Intuit Quickbooks Enterprise Tech Support Phone Number, Quickbooks Enterprise Help Desk Phone Number, Quickbooks Enterprise tech support number, Quickbooks Enterprise technical support phone number, Quickbooks Enterprise phone number, Quickbooks Enterprise technical support number, Quickbooks Enterprise support phone number. It is very popular toll free number which POSvide by Quickbooks Enterprise technical support, Quickbooks Enterprise Customer Service Phone Number, Quickbooks Enterprise Customer Service Number, Quickbooks Enterprise Customer Support Phone Number, Quickbooks Enterprise Customer Support Number, Quickbooks Enterprise Customer Service Helpline Number, Quickbooks Enterprise Customer Care Number, Quickbooks Enterprise support team phone number. Call, Quickbooks Enterprise tech support phone number, Intuit Quickbooks Enterprise Tech Support Phone Number, Quickbooks Enterprise Help Desk Phone Number, Quickbooks Enterprise tech support number, Quickbooks Enterprise technical support phone number, Quickbooks Enterprise phone number, Quickbooks Enterprise technical support number, Quickbooks Enterprise support phone number, Quickbooks Enterprise technical support, Quickbooks Enterprise Customer Service Phone Number, Quickbooks Enterprise Customer Service Number, Quickbooks Enterprise Customer Support Phone Number, Quickbooks Enterprise Customer Support Number, Quickbooks Enterprise Customer Service Helpline Number,Describe USA intuit Help @@1+800+860+9230@@ Quickbooks PREMIER technical support phone number 1-800-860-9230 Quickbooks PREMIER customer service phone number usa here.USA intuit Help @@1+800+860+9230@@ Quickbooks PREMIER technical support phone number 1-800-860-9230 Quickbooks PREMIER customer service phone number usa # Quickbooks PREMIER Toll Free, @(+1.800.860.9230)@-: Quickbooks PREMIER Tech Support Phone Number PREMIERvides online solution for all USA/CANADA clients. For any help of query call 1 800 to get all Quickbooks PREMIER account solution. @@Call, +1.800.860.9230 for all type help by Quickbooks PREMIER tech support phone number, Quickbooks PREMIER Tech Support Phone Number, Quickbooks PREMIER Help Desk Phone Number, Quickbooks PREMIER tech support number, Quickbooks PREMIER technical support phone number,@@@ Quickbooks PREMIER phone number, Quickbooks PREMIER technical support number, Quickbooks PREMIER support phone number, Quickbooks PREMIER technical support, Quickbooks PREMIER Customer Service Phone Number, Quickbooks PREMIER Customer Service Number, Quickbooks PREMIER Customer Support Phone Number, Quickbooks PREMIER Customer Support Number,@@@@ Quickbooks PREMIER Customer Service Helpline Number, Quickbooks PREMIER Customer Care Number, Quickbooks PREMIER support team phone number, @@@@@ Quickbooks PREMIER help number- Quickbooks PREMIER Helpline Number; Quickbooks PREMIER help phone number- Quickbooks PREMIER Helpline Number, Quickbooks PREMIER Tech Support Toll free Number, Quickbooks PREMIER Support Telephone Number, Quickbooks PREMIER Tech Support Telephone number, Quickbooks PREMIER Tech Support contact number, Quickbooks PREMIER support contact number, Quickbooks PREMIER technical support contact number. Call, Quickbooks PREMIER tech support phone number, Quickbooks PREMIER Tech Support Phone Number, Quickbooks PREMIER Help Desk Phone Number, Quickbooks PREMIER tech support number, Quickbooks PREMIER technical support phone number, Quickbooks PREMIER phone number, Quickbooks PREMIER technical support number, Quickbooks PREMIER support phone number. It is very popular toll free number which PREMIERvide by Quickbooks PREMIER technical support, Quickbooks PREMIER Customer Service Phone Number, Quickbooks PREMIER Customer Service Number, Quickbooks PREMIER Customer Support Phone Number, Quickbooks PREMIER Customer Support Number, Quickbooks PREMIER Customer Service Helpline Number, Quickbooks PREMIER Customer Care Number, Quickbooks PREMIER support team phone number. Call, Quickbooks PREMIER tech support phone number, Quickbooks PREMIER Tech Support Phone Number, Quickbooks PREMIER Help Desk Phone Number, Quickbooks PREMIER tech support number, Quickbooks PREMIER technical support phone number, Quickbooks PREMIER phone number, Quickbooks PREMIER technical support number, Quickbooks PREMIER support phone number, Quickbooks PREMIER technical support, Quickbooks PREMIER Customer Service Phone Number, Quickbooks PREMIER Customer Service Number, Quickbooks PREMIER Customer Support Phone Number, Quickbooks PREMIER Customer Support Number, Quickbooks PREMIER Customer Service Helpline Number, Quickbooks PREMIER Customer Care Number,CALL @@@ 1800.860.9230 Quickbooks pro s.u.p.p.o.r.t. .p.h.o.n.e. .n.u.m.b.e.r. usa/ca 1800.860.9230 Quickbooks pro s.u.p.p.o.r.t. .p.h.o.n.e. .n.u.m.b.e.r. usa Intuit@(1-800-860-9230)Quickbooks pro Tech Support Phone NumberIntuit?????@(1-800-860-9230)Quickbooks pro Tech Support Phone Number provides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all Quickbooks pro account solution. @@Call, 1-800-860-9230 for all type help by Quickbooks pro tech support phone number, Intuit Quickbooks pro Tech Support Phone Number, Quickbooks pro Help Desk Phone Number, Quickbooks pro tech support number, Quickbooks pro technical support phone number,@@@ Quickbooks pro phone number, Quickbooks pro technical support number, Quickbooks pro support phone number, Quickbooks pro technical support, Quickbooks pro CustomeraService?? Phone Number, Quickbooks pro Customer Service Number, Quickbooks pro Customer Support Phone Number, Quickbooks pro Customer Support Number,@@@@ Quickbooks pro Customer Service Helpline Number, Quickbooks pro Customer Care Number, Quickbooks pro support team phone number, @@@@@ Quickbooks pro help number-Quickbooks pro Helpline Number; Quickbooks pro help phone number-Quickbooks pro Helpline Number, Quickbooks pro Tech Support Toll free Number, Quickbooks pro Support Telephone Number, Quickbooks pro Tech Support Telephone number, Quickbooks pro Tech Support contact number, Quickbooks pro support contact number, Quickbooks pro technical support contact number. Call, Quickbooks pro tech support phone number, Intuit Quickbooks pro Tech Support Phone Number, Quickbooks pro Help Desk Phone Number, Quickbooks pro tech support number, Quickbooks pro technical support phone number, Quickbooks pro phone number, Quickbooks pro technical support number, Quickbooks pro support phone number. It is very popular toll free number which provide by Quickbooks pro technical support, Quickbooks pro Customer Service Phone Number, Quickbooks pro Customer Service Number, Quickbooks pro Customer Support Phone Number, Quickbooks pro Customer Support Number, Quickbooks pro Customer Service Helpline Number, Quickbooks pro Customer Care Number, Quickbooks pro support team phone number. Call, Quickbooks pro tech support phone number, Intuit Quickbooks pro Tech Support Phone Number, Quickbooks pro Help Desk Phone Number, Quickbooks pro tech support number, Quickbooks pro technical support phone number, Quickbooks pro phone number, Quickbooks pro technical support number, Quickbooks pro support phone number, Quickbooks pro technical support, Quickbooks pro Customer Service Phone Number, Quickbooks pro Customer Service Number, Quickbooks pro Customer Support Phone Number, Quickbooks pro Customer Support Number, Quickbooks pro Customer Service Helpline Number, Quickbooks pro Customer Care Number, Quickbooks pro support team phone number, Quickbooks pro help number-Quickbooks pro Helpline Number; Quickbooks pro help phone number, Quickbooks pro Helpline Number1800-860-9230 Quickbooks payroll technical help telephone number, Quickbooks payroll technical help contact number, Quickbooks payroll technical support contact number, Quickbooks payroll contact number, Quickbooks payroll contact phone number, Quickbooks payroll contact telephone number, Quickbooks payroll 24 hour contact number, Quickbooks payroll customer support contact number, Quickbooks payroll customer service contact number, Quickbooks payroll official number, Quickbooks payroll official contact number, Quickbooks payroll 800 contact number, Quickbooks payroll toll free number, 800 number for Quickbooks payroll support, Quickbooks payroll 24/7 support phone number Quickbooks payroll support phone number,Quickbooks payroll support phone number,Quickbooks payroll help phone number, Quickbooks payroll technical support number.Quickbooks payroll support number, Quickbooks payroll phone number, Quickbooks payroll HELP DESK number, Quickbooks payroll customer support number, Quickbooks payroll customer support phone number, Quickbooks payroll customer service phone number, Quickbooks payroll customer service phone number, Quickbooks payroll support phone number. Help@Call 1-800-860-9230/.Quickbooks payroll 24/7 support phone number,Quickbooks payroll telephone number for support? call 1800-860-9230@./Quickbooks payroll contact number, Quickbooks payroll contact phone number, Quickbooks payroll contact telephone number,,telephone number for Quickbooks payroll online support,Quickbooks payroll official support number,Quickbooks payroll official number,Quickbooks payroll official phone number,,,phone number for Quickbooks payroll support,,Quickbooks payroll 24/7 support phone number,,Quickbooks payroll support number,Quickbooks payroll telephone number for support QB SUPPORT ON ((1-800-860-9230)) Quickbooks payroll PHONE NUMBER AND Quickbooks payroll SUPPORT PHONE NUMBER Online Support For (((1+800+860+9230)!!! Quickbooks payroll ((Technical)) Support phone number,, Quickbooks payroll HELP DESK phone number Online Support For (((1+800+860+9230)!!! Quickbooks payroll ((Technical)) Support phone number,, Quickbooks payroll HELP DESK phone number Helpline TECH ))1-800-860-9230((Quickbooks payroll technical support phone number Quickbooks payroll phone number QB SUPPORT ON ((1-800-860-9230)) Quickbooks payroll PHONE NUMBER AND Quickbooks payroll SUPPORT PHONE NUMBER Quickbooks payroll Toll Free, Intuit@(1-800-860-9230)@ Quickbooks payroll HELP DESK Phone Number vides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all Quickbooks payroll account solution. @@Call, 1-800-860-9230 for all type help by Quickbooks payroll HELP DESK phone number, Intuit Quickbooks payroll HELP DESK Phone Number, Quickbooks payroll Help Desk Phone Number, Quickbooks payroll HELP DESK number @Call, 1-800-860-9230 for all type help by Quickbooks pos tech support phone USA, Quickbooks pos Quickbooks pos Tech Support Phone USA, Quickbooks pos Help Desk Phone USA, Quickbooks pos tech support USA, Quickbooks pos technical support phone USA,@@@ Quickbooks pos phone USA, Quickbooks pos technical support USA, Quickbooks pos support phone USA, Quickbooks pos technical support, Quickbooks pos Customer Service Phone USA, Quickbooks pos Customer Service USA, Quickbooks pos Customer Support Phone USA, Quickbooks pos Customer Support USA,@@@@ Quickbooks pos Customer Service Helpline USA, Quickbooks pos Customer Care USA, Quickbooks pos support team phone USA, @@@@@ Quickbooks pos help USA-Quickbooks pos Helpline USA; Quickbooks pos help phone USA-Quickbooks pos Helpline USA, Quickbooks pos Tech Support Toll free USA, Quickbooks pos Support Telephone USA, Quickbooks pos Tech Support Telephone USA, Quickbooks pos Tech Support contact USA, Quickbooks pos support contact USA, Quickbooks pos technical support contact USA. Call, Quickbooks pos tech support phone USA, Quickbooks pos Quickbooks pos Tech Support Phone USA, Quickbooks pos Help Desk Phone USA, Quickbooks pos tech support USA, Quickbooks pos technical support phone USA, Quickbooks pos phone USA, Quickbooks pos technical support USA, Quickbooks pos support phone USA. It is very popular toll free USA which vide by Quickbooks pos technical support, Quickbooks pos Customer Service Phone USA, Quickbooks pos Customer Service USA, Quickbooks pos Customer Support Phone USA, Quickbooks pos Customer Support USA, Quickbooks pos Customer Service Helpline USA, Quickbooks pos Customer Care USA, Quickbooks pos support team phone USA. Call, Quickbooks pos tech support phone USA, Quickbooks pos Quickbooks pos Tech Support Phone USA, Quickbooks pos Help Desk Phone USA, Quickbooks pos tech support USA, Quickbooks pos technical support phone USA, Quickbooks pos phone USA, Quickbooks pos technical support USA, Quickbooks pos support phone USA, Quickbooks pos technical support, Quickbooks pos Customer Service Phone USA, Quickbooks pos Customer Service USA, Quickbooks pos Customer Support Phone USA, Quickbooks pos Customer Support USA, Quickbooks pos Customer Service Helpline USA, Quickbooks pos Customer Care USA, Quickbooks pos support team phone USA, Quickbooks pos help USA-Quickbooks pos Helpline USA; Quickbooks pos help phone USA, Quickbooks pos Helpline USA, Quickbooks pos Tech Support Toll free USA, Quickbooks pos Support Telephone USA, Quickbooks pos Tech Support Telephone USA, Quickbooks pos Tech Support contact USA, Quickbooks pos support contact USA, Quickbooks pos technical support contact USA, Quickbooks pos support phone USA, ","customfield_13200":null,"customfield_11300":null,"customfield_11500":null,"timetracking":{},"customfield_10401":null,"customfield_10005":null,"customfield_10600":null,"customfield_12900":null,"aggregatetimeestimate":null,"attachment":[],"summary":"Andrews QuickBooks Talk @(1-800-860-9230) QuickBooks Tech Support Phone Number 1-800-860-9230 QuickBooks Helpline Number ","creator":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=connerys153","name":"connerys153","key":"connerys153","accountId":"557058:d136af85-bcc2-4813-b9a0-4caaca769795","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/5e5d5bf1b00181df9fa2738a706b5421?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/5e5d5bf1b00181df9fa2738a706b5421?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/5e5d5bf1b00181df9fa2738a706b5421?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/5e5d5bf1b00181df9fa2738a706b5421?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"connerys153","active":false,"timeZone":"US/Central"},"subtasks":[],"reporter":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=connerys153","name":"connerys153","key":"connerys153","accountId":"557058:d136af85-bcc2-4813-b9a0-4caaca769795","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/5e5d5bf1b00181df9fa2738a706b5421?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/5e5d5bf1b00181df9fa2738a706b5421?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/5e5d5bf1b00181df9fa2738a706b5421?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/5e5d5bf1b00181df9fa2738a706b5421?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"connerys153","active":false,"timeZone":"US/Central"},"aggregateprogress":{"progress":0,"total":0},"customfield_10000":"6_*:*_1_*:*_0_*|*_10000_*:*_1_*:*_813105","customfield_12100":"0|i03ugf:","customfield_10001":null,"customfield_10200":null,"customfield_10002":null,"customfield_10003":null,"customfield_10400":null,"customfield_12500":null,"customfield_11600":["connerys153(connerys153)"],"customfield_10116":null,"environment":null,"customfield_10117":null,"customfield_11800":null,"customfield_11802":null,"customfield_11805":null,"duedate":null,"progress":{"progress":0,"total":0},"customfield_11806":null,"comment":{"comments":[],"maxResults":0,"total":0,"startAt":0},"votes":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12525/votes","votes":0,"hasVoted":false},"customfield_11808":null,"worklog":{"startAt":0,"maxResults":20,"total":0,"worklogs":[]}}}