{"expand":"renderedFields,names,schema,operations,editmeta,changelog,versionedRepresentations","id":"45421","self":"https://eucalyptus.atlassian.net/rest/api/2/issue/45421","key":"EUCA-12523","fields":{"issuetype":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issuetype/1","id":"1","description":"A problem which impairs or prevents the functions of the product.","iconUrl":"https://eucalyptus.atlassian.net/secure/viewavatar?size=xsmall&avatarId=14803&avatarType=issuetype","name":"Bug","subtask":false,"avatarId":14803},"timespent":null,"customfield_13100":null,"project":{"self":"https://eucalyptus.atlassian.net/rest/api/2/project/10000","id":"10000","key":"EUCA","name":"Eucalyptus","avatarUrls":{"48x48":"https://eucalyptus.atlassian.net/secure/projectavatar?pid=10000&avatarId=10011","24x24":"https://eucalyptus.atlassian.net/secure/projectavatar?size=small&pid=10000&avatarId=10011","16x16":"https://eucalyptus.atlassian.net/secure/projectavatar?size=xsmall&pid=10000&avatarId=10011","32x32":"https://eucalyptus.atlassian.net/secure/projectavatar?size=medium&pid=10000&avatarId=10011"}},"customfield_11000":null,"customfield_11001":null,"fixVersions":[],"aggregatetimespent":null,"resolution":{"self":"https://eucalyptus.atlassian.net/rest/api/2/resolution/6","id":"6","description":"The product is working as designed.","name":"Not a Bug"},"customfield_10310":null,"customfield_10311":null,"customfield_11401":null,"customfield_11400":null,"customfield_10500":{"self":"https://eucalyptus.atlassian.net/rest/api/2/customFieldOption/10403","value":"Not Applicable","id":"10403"},"customfield_10302":null,"customfield_10104":[],"customfield_10105":null,"customfield_10303":null,"customfield_10700":null,"customfield_10304":null,"customfield_10701":null,"customfield_10306":null,"customfield_10702":null,"customfield_10703":null,"customfield_10308":null,"resolutiondate":"2016-06-30T15:28:55.936-0500","customfield_10704":null,"customfield_10705":null,"customfield_10309":null,"workratio":-1,"lastViewed":null,"watches":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12523/watchers","watchCount":1,"isWatching":false},"created":"2016-06-30T15:12:33.592-0500","customfield_12000":null,"priority":{"self":"https://eucalyptus.atlassian.net/rest/api/2/priority/3","iconUrl":"https://eucalyptus.atlassian.net/images/icons/priorities/major.svg","name":"Major","id":"3"},"customfield_12400":null,"customfield_12201":null,"customfield_10102":null,"customfield_12600":"{}","customfield_10300":null,"labels":[],"customfield_10301":null,"customfield_11700":null,"timeestimate":null,"aggregatetimeoriginalestimate":null,"customfield_11901":null,"versions":[],"issuelinks":[],"assignee":null,"updated":"2016-06-30T15:28:55.947-0500","status":{"self":"https://eucalyptus.atlassian.net/rest/api/2/status/6","description":"The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.","iconUrl":"https://eucalyptus.atlassian.net/images/icons/statuses/generic.png","name":"Closed","id":"6","statusCategory":{"self":"https://eucalyptus.atlassian.net/rest/api/2/statuscategory/3","id":3,"key":"done","colorName":"green","name":"Done"}},"components":[],"timeoriginalestimate":null,"description":"call )(((1+800-860-9230 )))@./quickbooks contact number, quickbooks contact phone number, quickbooks contact telephone numbertelephone number for quickbooks online support,quickbooks official support number,quickbooks official number,quickbooks payroll official phone number,phone number for quickbooks payroll supportquickbooks 24/7 support phone numberquickbooks support number,quickbooks telephone number for support\r\n\r\n................. QuickBooks PRO phone number,(1-800-860-9230)// QuickBooks PRO customer care number..... QuickBooks PRO Toll Free, Intuit@(1-800.860-9230)@-: QuickBooks PRO Technical Support Number, QuickBooks PRO help desk phone number provides online solution for all USA/CANADA clients. For any help of query call 1 800 860 9230 to get all QuickBooks PRO account solution. For any help of query call 1 800 860 9230 to get all QuickBooks PRO account solution. @@Call, 1-800-860-9230 for all type help by QuickBooks PRO support telephone number,QuickBooks PRO support phone number,QuickBooks PRO support phone number,QuickBooks PRO help phone number, QuickBooks PRO technical support number.QuickBooks PRO support number, QuickBooks PRO phone number, QuickBooks PRO tech support number, QuickBooks PRO customer support number, QuickBooks PRO customer support phone number, QuickBooks PRO customer service phone number, QuickBooks PRO payroll customer service phone number, QuickBooks PRO support phone number QuickBooks PRO help number-QuickBooks PRO Helpline Number; QuickBooks PRO help phone number-QuickBooks PRO Helpline Number, QuickBooks PRO Tech Support Toll free Number, QuickBooks PRO Support Telephone Number, QuickBooks PRO Tech Support Telephone number, QuickBooks PRO Tech Support contact number, QuickBooks PRO support contact number, QuickBooks PRO technical support contact number, QuickBooks PRO help desk phone number. Call, @(1-800-860-9230)@-: It is very popular toll free number which provide by QuickBooks PRO technical support, QuickBooks PRO Customer Service Phone Number, QuickBooks PRO Customer Service Number, QuickBooks PRO Customer Support Phone Number, QuickBooks PRO Customer Support Number, QuickBooks PRO Customer Service Helpline Number, QuickBooks PRO Customer Care Number, QuickBooks PRO support team phone number. Call,@(1-800-860-9230)@-: QuickBooks PRO help number-QuickBooks PRO Helpline Number; QuickBooks PRO help phone number, QuickBooks PRO Helpline Number, QuickBooks PRO Tech Support Toll free Number, QuickBooks PRO Support Telephone Number, QuickBooks PRO Tech Support Telephone number, QuickBooks PRO Tech Support contact number, QuickBooks PRO support contact number, QuickBooks PRO technical support contact number, QuickBooks PRO pro support phone number, QuickBooks PRO payroll support phone number. QuickBooks PRO payroll customer support phone number for all type help by QuickBooks PRO support telephone number, QuickBooks PRO help phone number, QuickBooks PRO technical support number.QuickBooks PRO support number, QuickBooks PRO phone number, QuickBooks PRO tech support number, QuickBooks PRO customer support number, QuickBooks PRO customer support phone number, QuickBooks PRO customer service phone number, QuickBooks PRO payroll customer service phone number call (1 800 860 9230) to get all QuickBooks payroll account solution. @@Call,1-800-860-9230 for all type help by QuickBooks payroll support telephone number,QuickBooks payroll support phone number,QuickBooks payroll support phone number,QuickBooks payroll help phone number, QuickBooks payroll technical support number.QuickBooks payroll support number, QuickBooks payroll phone number, QuickBooks payroll tech support number, QuickBooks payroll customer support number, QuickBooks payroll customer support phone number, QuickBooks payroll customer service phone number, QuickBooks payroll payroll customer service phone number, QuickBooks payroll support phone number QuickBooks payroll help number-QuickBooks payroll Helpline Number; QuickBooks payroll help phone number-QuickBooks payroll Helpline Number, QuickBooks payroll Tech Support Toll free Number, QuickBooks payroll Support Telephone Number, QuickBooks payroll Tech Support Telephone number, QuickBooks payroll Tech Support contact number, QuickBooks payroll support contact number, QuickBooks payroll technical support contact number, QuickBooks payroll help desk phone number. Call, @(1-800-860-9230)@-: It is very popular toll free number which vide by QuickBooks payroll technical support, QuickBooks payroll Customer Service Phone Number, QuickBooks payroll Customer Service Number, QuickBooks payroll Customer Support Phone Number, QuickBooks payroll Customer Support Number, QuickBooks payroll Customer Service Helpline Number, QuickBooks payroll Customer Care Number, QuickBooks payroll support team phone number. Call,@(1-800-860-9230)@-: QuickBooks payroll help number-QuickBooks payroll Helpline Number; QuickBooks payroll help phone number, QuickBooks payroll Helpline Number, QuickBooks payroll Tech Support Toll free Number, QuickBooks payroll Support Telephone Number, QuickBooks payroll Tech Support Telephone number, QuickBooks payroll Tech Support contact number, QuickBooks payroll support contact number, QuickBooks payroll technical support contact number, QuickBooks payroll support phone number, QuickBooks payroll payroll support phone number. QuickBooks payroll payroll customer support phone number for all type help by QuickBooks payroll support telephone number, QuickBooks payroll help phone number, QuickBooks payroll technical support number.QuickBooks payroll support number, QuickBooks payroll phone number, QuickBooks payroll tech support number, QuickBooks payroll customer support number, QuickBooks payroll customer support phone number, QuickBooks payroll customer service phone number, QuickBooks payroll payroll customer service phone number QuickBooks payroll numebr1(800) 860.9230\"QuickBooks payroll tech support phone number canada, QuickBooks payroll tech support phone number QuickBooks payroll enterprise phone number. QuickBooks payroll enterprise support phone number, QuickBooks payroll enterprise phone number, QuickBooks payroll enterprise tech support number, QuickBooks payroll enterprise customer support number, QuickBooks payroll enterprise tech support number, QuickBooks payroll enterprise technical support number, QuickBooks payroll enterprise tech support phone number QuickBooks payroll technical support line QuickBooks payroll enterprise tech support number QuickBooks payroll proadvisor tech support number QuickBooks payroll pos tech support number QuickBooks payroll tech support phone number canada QuickBooks payroll online tech support number QuickBooks payroll tech support phone number uk QuickBooks payroll pro tech support number QuickBooks payroll online technical support number QuickBooks payroll enterprise technical support number QuickBooks payroll tech support numberQuickBooks payroll technical support australia QuickBooks payroll technical support phone number australia QuickBooks payroll tech support contact number QuickBooks payroll tech support canada QuickBooks payroll tech support cost QuickBooks payroll technical support canada\r\n\r\n@@Call, 1-800-860-9230 for all type help by QuickBooks Proadvisor tech support phone number, Intuit QuickBooks Proadvisor Tech Support Phone Number, QuickBooks Proadvisor Help Desk Phone Number, QuickBooks Proadvisor tech support number, QuickBooks Proadvisor technical support phone number,@@@ QuickBooks Proadvisor phone number, QuickBooks Proadvisor technical support number, QuickBooks Proadvisor support phone number, QuickBooks Proadvisor technical support, QuickBooks Proadvisor Customer Service Phone Number, QuickBooks Proadvisor Customer Service Number, QuickBooks Proadvisor Customer Support Phone Number, QuickBooks Proadvisor Customer Support Number,@@@@ QuickBooks Proadvisor Customer Service Helpline Number, QuickBooks Proadvisor Customer Care Number, QuickBooks Proadvisor support team phone number, @@@@@ QuickBooks Proadvisor help number-QuickBooks Proadvisor Helpline Number; QuickBooks Proadvisor help phone number-QuickBooks Proadvisor Helpline Number, QuickBooks Proadvisor Tech Support Toll free Number, QuickBooks Proadvisor Support Telephone Number, QuickBooks Proadvisor Tech Support Telephone number, QuickBooks Proadvisor Tech Support contact number, QuickBooks Proadvisor support contact number, QuickBooks Proadvisor technical support contact number. Call, QuickBooks Proadvisor tech support phone number, Intuit QuickBooks Proadvisor Tech Support Phone Number, QuickBooks Proadvisor Help Desk Phone Number, QuickBooks Proadvisor tech support number, QuickBooks Proadvisor technical support phone number, QuickBooks Proadvisor phone number, QuickBooks Proadvisor technical support number, QuickBooks Proadvisor support phone number. It is very popular toll free number which provide by QuickBooks Proadvisor technical support, QuickBooks Proadvisor Customer Service Phone Number, QuickBooks Proadvisor Customer Service Number, QuickBooks Proadvisor Customer Support Phone Number, QuickBooks Proadvisor Customer Support Number, QuickBooks Proadvisor Customer Service Helpline Number, QuickBooks Proadvisor Customer Care Number, QuickBooks Proadvisor support team phone number. Call, QuickBooks Proadvisor tech support phone number, Intuit QuickBooks Proadvisor Tech Support Phone Number, QuickBooks Proadvisor Help Desk Phone Number, QuickBooks Proadvisor tech support number, QuickBooks Proadvisor technical support phone number, QuickBooks Proadvisor phone number, QuickBooks Proadvisor technical support number, QuickBooks Proadvisor support phone number, QuickBooks Proadvisor technical support, QuickBooks Proadvisor Customer Service Phone Number, QuickBooks Proadvisor Customer Service Number, QuickBooks Proadvisor Customer Support Phone Number, QuickBooks Proadvisor Customer Support Number, QuickBooks Proadvisor Customer Service Helpline Number, QuickBooks Proadvisor Customer Care Number, QuickBooks Proadvisor support team phone number, QuickBooks Proadvisor help number-QuickBooks Proadvisor Helpline Number; QuickBooks Proadvisor help phone number, QuickBooks Proadvisor Helpline Number, QuickBooks Proadvisor Tech Support Toll free Number, QuickBooks Proadvisor Support Telephone Number, QuickBooks Proadvisor Tech Support Telephone number, QuickBooks Proadvisor Tech Support contact number, QuickBooks Proadvisor support contact number, QuickBooks Proadvisor technical support contact number, QuickBooks Proadvisor pro support phone number, QuickBooks Proadvisor payroll support phone number. QuickBooks Proadvisor payroll customer support phone number\r\n","customfield_13000":null,"customfield_13200":null,"customfield_11300":null,"customfield_11500":null,"timetracking":{},"customfield_10401":null,"customfield_10005":null,"customfield_10600":null,"customfield_12900":null,"aggregatetimeestimate":null,"attachment":[],"summary":"Quickbooks Support Phone (((1 800 860 9230 USA)) Quickbooks Support Phone Number USA","creator":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=brijwasipitt","name":"brijwasipitt","key":"brijwasipitt","accountId":"557058:6eba3fa6-0afe-4f54-a0d7-b2d239e6dd7a","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"Pitt Brijwasi","active":false,"timeZone":"US/Central"},"subtasks":[],"reporter":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=brijwasipitt","name":"brijwasipitt","key":"brijwasipitt","accountId":"557058:6eba3fa6-0afe-4f54-a0d7-b2d239e6dd7a","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/776baa3e759a4802c9fc250439d9e453?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"Pitt Brijwasi","active":false,"timeZone":"US/Central"},"customfield_10000":"6_*:*_1_*:*_0_*|*_10000_*:*_1_*:*_982357","aggregateprogress":{"progress":0,"total":0},"customfield_12100":"0|i03ufz:","customfield_10001":null,"customfield_10200":null,"customfield_10002":null,"customfield_10003":null,"customfield_10400":null,"customfield_12500":null,"customfield_10116":null,"customfield_11600":["brijwasipitt(brijwasipitt)"],"environment":null,"customfield_10117":null,"customfield_11800":null,"customfield_11802":null,"customfield_11805":null,"duedate":null,"progress":{"progress":0,"total":0},"customfield_11806":null,"votes":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12523/votes","votes":0,"hasVoted":false},"comment":{"comments":[],"maxResults":0,"total":0,"startAt":0},"customfield_11808":null,"worklog":{"startAt":0,"maxResults":20,"total":0,"worklogs":[]}}}