{"expand":"renderedFields,names,schema,operations,editmeta,changelog,versionedRepresentations","id":"45427","self":"https://eucalyptus.atlassian.net/rest/api/2/issue/45427","key":"EUCA-12529","fields":{"issuetype":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issuetype/1","id":"1","description":"A problem which impairs or prevents the functions of the product.","iconUrl":"https://eucalyptus.atlassian.net/secure/viewavatar?size=xsmall&avatarId=14803&avatarType=issuetype","name":"Bug","subtask":false,"avatarId":14803},"timespent":null,"customfield_13100":null,"project":{"self":"https://eucalyptus.atlassian.net/rest/api/2/project/10000","id":"10000","key":"EUCA","name":"Eucalyptus","avatarUrls":{"48x48":"https://eucalyptus.atlassian.net/secure/projectavatar?pid=10000&avatarId=10011","24x24":"https://eucalyptus.atlassian.net/secure/projectavatar?size=small&pid=10000&avatarId=10011","16x16":"https://eucalyptus.atlassian.net/secure/projectavatar?size=xsmall&pid=10000&avatarId=10011","32x32":"https://eucalyptus.atlassian.net/secure/projectavatar?size=medium&pid=10000&avatarId=10011"}},"customfield_11000":null,"customfield_11001":null,"fixVersions":[],"aggregatetimespent":null,"customfield_10310":null,"resolution":{"self":"https://eucalyptus.atlassian.net/rest/api/2/resolution/6","id":"6","description":"The product is working as designed.","name":"Not a Bug"},"customfield_10311":null,"customfield_11401":null,"customfield_11400":null,"customfield_10500":{"self":"https://eucalyptus.atlassian.net/rest/api/2/customFieldOption/10403","value":"Not Applicable","id":"10403"},"customfield_10302":null,"customfield_10104":[],"customfield_10303":null,"customfield_10105":null,"customfield_10700":null,"customfield_10304":null,"customfield_10701":null,"customfield_10306":null,"customfield_10702":null,"customfield_10703":null,"customfield_10704":null,"resolutiondate":"2016-06-30T15:23:54.747-0500","customfield_10308":null,"customfield_10309":null,"customfield_10705":null,"workratio":-1,"lastViewed":null,"watches":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12529/watchers","watchCount":1,"isWatching":false},"created":"2016-06-30T15:21:06.167-0500","customfield_12000":null,"customfield_12400":null,"priority":{"self":"https://eucalyptus.atlassian.net/rest/api/2/priority/3","iconUrl":"https://eucalyptus.atlassian.net/images/icons/priorities/major.svg","name":"Major","id":"3"},"customfield_12201":null,"customfield_10102":null,"customfield_10300":null,"customfield_12600":"{}","customfield_10301":null,"labels":[],"customfield_11700":null,"aggregatetimeoriginalestimate":null,"timeestimate":null,"customfield_11901":null,"versions":[],"issuelinks":[],"assignee":null,"updated":"2016-06-30T15:23:54.756-0500","status":{"self":"https://eucalyptus.atlassian.net/rest/api/2/status/6","description":"The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.","iconUrl":"https://eucalyptus.atlassian.net/images/icons/statuses/generic.png","name":"Closed","id":"6","statusCategory":{"self":"https://eucalyptus.atlassian.net/rest/api/2/statuscategory/3","id":3,"key":"done","colorName":"green","name":"Done"}},"components":[],"timeoriginalestimate":null,"description":"Quickbooks account solution. 1 800.860.9230 For any help of query call 1 800.860.9230 to get all Quickbooks account solution. @@Call, 800.860.9230 for all type help by Quickbooks support telephone number,Quickbooks support phone number,Quickbooks support phone number,Quickbooks help phone number, Quickbooks Helpline Number 800.860.9230 Quickbooks technical support number.Quickbooks support number, Quickbooks phone number, Quickbooks tech support number, Quickbooks customer support number, Quickbooks customer support phone number, Quickbooks customer service phone number, 800.860.9230 Quickbooks Quickbooks customer service phone number, Quickbooks support phone number Quickbooks help number.Quickbooks Helpline Number; Quickbooks help phone number.Quickbooks Helpline Number, Quickbooks Tech Support Toll free Number, Quickbooks Support Telephone Number, Quickbooks Tech Support Telephone number, 800.860.9230 Quickbooks Tech Support contact number, Quickbooks support contact number, Quickbooks technical support contact number, Quickbooks help desk phone number.Quickbooks password recovery support phone number. Call, @(800.860.9230)@.: Quickbooks password recovery support phone number. It@@Call, 800.860.9230 for Quickbooks customer support telephone number,Quickbooks support phone number is very popular toll free number which vose by Quickbooks technical support, Quickbooks Customer Service Phone Number 800.860.9230, Quickbooks Customer Service Number, Quickbooks Customer Support Phone Number, Quickbooks Customer Support Number, Quickbooks Customer Service Helpline Number, Quickbooks Customer Care Number, Quickbooks support team phone number. Quickbooks password recovery support phone number. Call,@(800.860.9230)@.: Quickbooks help number.Quickbooks Helpline Number; Quickbooks help phone number, Quickbooks Helpline Number, Quickbooks Tech Support Toll free Number, Quickbooks Support Telephone Number, Quickbooks Tech Support Telephone number, Quickbooks Tech Support contact number, Quickbooks support contact number, Quickbooks technical support contact number, Quickbooks support phone number, Quickbooks Quickbooks support phone number. Quickbooks Quickbooks customer support phone number.. Quickbooks password reset support phone number. for all type help by Quickbooks support telephone number, Quickbooks help phone number, Quickbooks technical support number.Quickbooks support number, Quickbooks phone number, Quickbooks tech support number, Quickbooks customer support number, Quickbooks customer support phone number, Quickbooks customer service phone number, Quickbooks Quickbooks customer service phone number Quickbooks Toll Free, @(800.860.9230)@.: Quickbooks Technical Support number usa, Quickbooks help desk phone number usa voses online solution for all USA/CANADA clients. For any help of query call I 800.860.9230 to get all Quickbooks account solution. 1 800.860.9230 For any help of query call 1 800.860.9230 to get all Quickbooks account solution. @@Call, 800.860.9230 for all type help by Quickbooks support phone number usa,Quickbooks support phone number usa,Quickbooks support phone number usa,Quickbooks help phone number usa, Quickbooks technical support number usa.Quickbooks support number usa, Quickbooks phone number usa, Quickbooks tech support number usa, Quickbooks customer support number usa, Quickbooks customer support phone number usa, Quickbooks customer service phone number usa, Quickbooks Quickbooks customer service phone number usa, Quickbooks support phone number usa Quickbooks help number usa.Quickbooks Helpline number usa; Quickbooks help phone number usa.Quickbooks Helpline number usa, Quickbooks Tech Support Toll free number usa, Quickbooks Support Telephone number usa, Quickbooks Tech Support Telephone number usa, Quickbooks Tech Support contact number usa, Quickbooks support contact number usa, Quickbooks technical support contact number usa, Quickbooks help desk phone number usa.Quickbooks password recovery support phone number usa. Call, @(800.860.9230)@.: Quickbooks password recovery support phone number usa. It is very popular toll free number usa which vose by Quickbooks technical support, Quickbooks Customer Service Phone number usa, Quickbooks Customer Service number usa, Quickbooks Customer Support Phone number usa, Quickbooks Customer Support number usa, Quickbooks Customer Service Helpline number usa, Quickbooks Customer Care number usa, Quickbooks support team phone number usa. Quickbooks password recovery support phone number usa. Call,@(800.860.9230)@.: Quickbooks help number usa.Quickbooks Helpline number usa; Quickbooks help phone number usa, Quickbooks Helpline number usa, Quickbooks Tech Support Toll free number usa, Quickbooks Support Telephone number usa, Quickbooks Tech Support Telephone number usa, Quickbooks Tech Support contact number usa, Quickbooks support contact number usa, Quickbooks technical support contact number usa, Quickbooks support phone number usa, Quickbooks Quickbooks support phone number usa. Quickbooks Quickbooks customer support phone number usa.. Quickbooks password reset support phone number usa. for all type help by Quickbooks support telephone number usa, Quickbooks help phone number usa, Quickbooks technical support number usa.Quickbooks support number usa, Quickbooks phone number usa, Quickbooks tech support number usa, Quickbooks customer support number usa, Quickbooks customer support phone number usa, Quickbooks customer service phone number usa, Quickbooks Quickbooks customer service phone number usa @@Call, 800.860.9230 for all type help by Quickbooks support telephone number,Quickbooks support phone number,Quickbooks support phone number,Quickbooks help phone number, Quickbooks technical support number.Quickbooks support number, Quickbooks phone number, Quickbooks tech support number, Quickbooks customer support number, Quickbooks customer support phone number, Quickbooks customer service phone number, Quickbooks Quickbooks customer service phone number, Quickbooks support phone number Quickbooks help number.Quickbooks Helpline Number; Quickbooks help phone number.Quickbooks Helpline Number, Quickbooks Tech Support Toll free Number, Quickbooks Support Telephone Number, Quickbooks Tech Support Telephone number, Quickbooks Tech Support contact number, Quickbooks support contact number, Quickbooks technical support contact number, Quickbooks help desk phone number.Quickbooks password recovery support phone number. Call, @( 800.860.9230)@.: Quickbooks password recovery support phone number. It is very popular toll free number which vose by Quickbooks technical support, Quickbooks Customer Service Phone Number, Quickbooks Customer Service Number, Quickbooks Customer Support Phone Number, Quickbooks Customer Support Number, Quickbooks Customer Service Helpline Number, Quickbooks Customer Care Number, Quickbooks support team phone number. Quickbooks password recovery support phone number. Call,@( 800.860.9230)@.: Quickbooks help number.Quickbooks Helpline Number; Quickbooks help phone number, Quickbooks Helpline Number, Quickbooks Tech Support Toll free Number, Quickbooks Support Telephone Number, Quickbooks Tech Support Telephone number, Quickbooks Tech Support contact number, Quickbooks support contact number, Quickbooks technical support contact number, Quickbooks support phone number, Quickbooks Quickbooks support phone number. Quickbooks Quickbooks customer support phone number.. Quickbooks password reset support phone number. for all type help by Quickbooks support telephone number, Quickbooks help phone number, Quickbooks technical support number.Quickbooks support number, Quickbooks phone number, Quickbooks tech support number, Quickbooks customer support number, Quickbooks customer support phone number, Quickbooks customer service phone number, Quickbooks Quickbooks customer service phone number Just Call 800.860.9230 Quickbooks customer support phone number Quickbooks Toll Free @(800.860.9230)@ Quickbooks Technical Support phone Number,Quickbooks phone number usa Quickbooks help desk phone number voses online solution for all USA/CANADA clients. For any help of query call I 800.860.9230 to get all Quickbooks account solution. 1 800.860.9230 For any help of query call 1 800.860.9230 to get all Quickbooks account solution. @@Call, 800.860.9230 for all type help by Quickbooks support telephone number,Quickbooks support phone number,Quickbooks support phone number,Quickbooks help phone number, Quickbooks Helpline Number 800.860.9230 Quickbooks technical support number.Quickbooks support number, Quickbooks phone number, Quickbooks tech support number, Quickbooks customer support number, Quickbooks customer support phone number, Quickbooks customer service phone number, 800.860.9230 Quickbooks Quickbooks customer service phone number, Quickbooks support phone number Quickbooks help number.Quickbooks Helpline Number; Quickbooks help phone number.Quickbooks Helpline Number, Quickbooks Tech Support Toll free Number, Quickbooks Support Telephone Number, Quickbooks Tech Support Telephone number, 800.860.9230 Quickbooks Tech Support contact number, Quickbooks support contact number, Quickbooks technical support contact number, Quickbooks help desk phone number.Quickbooks password recovery support phone number. Call, @(800.860.9230)@.: Quickbooks password recovery support phone number. It@@Call, 800.860.9230 for Quickbooks customer support telephone number,Quickbooks support phone number is very popular toll free number which vose by Quickbooks technical support, Quickbooks Customer Service Phone Number 800.860.9230, Quickbooks Customer Service Number, Quickbooks Customer Support Phone Number, Quickbooks Customer Support Number, Quickbooks Customer Service Helpline Number, Quickbooks Customer Care Number, Quickbooks support team phone number. Quickbooks password recovery support phone number. Call,@(800.860.9230)@.: Quickbooks help number.Quickbooks Helpline Number; Quickbooks help phone number, Quickbooks Helpline Number, Quickbooks Tech Support Toll free Number, Quickbooks Support Telephone Number, Quickbooks Tech Support Telephone number, Quickbooks Tech Support contact number, Quickbooks support contact number, Quickbooks technical support contact number, Quickbooks support phone number, Quickbooks Quickbooks support phone number. Quickbooks Quickbooks customer support phone number.. Quickbooks password reset support phone number. for all type help by Quickbooks support telephone number, Quickbooks computer support, Quickbooks tech support chat, Quickbooks helpline number, Quickbooks laptop support, hewlett packard tech support, Quickbooks online chat, hewlett packard technical support, Quickbooks help line, phone number for Quickbooks support, hewlett packard support phone number, Quickbooks technical support, hewlett packard customer service number, Quickbooks service number, hewlett packard helpline, Quickbooks customer care no, Quickbooks customer service number, Quickbooks help number, Quickbooks customer service phone number, Quickbooks 1800 number, Quickbooks support phone, Quickbooks support line, hewlett packard contact number, Quickbooks tech support phone number, Quickbooks customer support phone number, Quickbookss help, call Quickbooks support, ##Quickbooks support## chat, hewlett packard support number, hewlett packard tech support number, Quickbooks support telephone number, hewlett packard tech support phone number, call Quickbooks, Quickbooks contact support, hewlett packard technical support phone number, Quickbooks support centre, hewlett packard customer support, Quickbooks desktop support, Quickbooks laptop customer service, contact Quickbooks support, Quickbooks pc support, Quickbooks laptop customer care number, Quickbooks support fors, Quickbooks customer care, Quickbooks customer care phone number, hewlett packard help, phone number for Quickbooks, Quickbooks online help, Quickbooks laptop customer care, Quickbooks helpline phone number, Quickbooks customer support, Quickbooks technical support chat, Quickbooks computer help, Quickbooks support numbers, Quickbooks technical support contact number, Quickbooks telephone number, Quickbooks technical support phone number, Quickbooks helpline, Quickbooks supports, Quickbooks support online, Quickbooks contact number, Quickbooks help phone number, Quickbooks customer care number, contact hewlett packard by phone, Quickbooks phone support, hewlett packards support, Quickbooks tech support phone, Quickbooks technical help, Quickbooks laptop tech support number, contact Quickbooks by phone, Quickbooks support call, Quickbooks computers support, hewlett packard customer service telephone number, phone number for hewlett packard, Quickbooks online support chat, Quickbooks laptop customer service number, Quickbooks online chat support, Quickbookss customer service, hewlett packard customer service phone, Quickbooks laptop tech support, Quickbooks service phone number, hewlett packard help, phone number for Quickbookss, Quickbooks troubleshooting phone number, Quickbooks 800 number, hewlett packard technical support number, contact Quickbooks support phone, phone number for Quickbooks support, Quickbooks customer support chat, Quickbooks help and support number, contact hewlett packard, Quickbooks laptop support phone number, Quickbookss customer service phone number, Quickbooks laptop customer service phone number, Quickbooks computer support phone number, Quickbooks pavilion support, Quickbooks computer customer service, Quickbooks customer services, hewlett packard telephone number, Quickbooks helpline no, Quickbooks help desk number, contact Quickbooks support phone number, hewlett packard contact, Quickbooks phone numbers, Quickbookss customer care number, Quickbooks help and support, contact Quickbooks technical support, Quickbooks contact numbers, contact Quickbooks support chat, call Quickbooks tech support, Quickbooks customer service phone, Quickbooks help support, Quickbooks computer tech support, Quickbooks assistance phone number, Quickbooks customer service telephone number, hewlett packard support phone number, Quickbooks contact support number, Quickbooks support center phone number, Quickbooks support phone numbers, tech support for Quickbooks, Quickbooks it support, Quickbooks laptop helpline, Quickbooks technical, Quickbooks laptop technical support number, Quickbookss tech support phone number, Quickbookss support phone number, hewlett packard help desk phone number, Quickbooks computer tech support phone number, Quickbooks customer service number for laptop, Quickbooks helpline number, contact Quickbooks support by phone, hewlett packard support center, Quickbooks laptop customer care no, Quickbooks support telephone number, ","customfield_13000":null,"customfield_13200":null,"customfield_11300":null,"customfield_11500":null,"timetracking":{},"customfield_10401":null,"customfield_10005":null,"customfield_10600":null,"customfield_12900":null,"attachment":[],"aggregatetimeestimate":null,"summary":"Quickbooks Pos)) 1800.860.9230 Quickbooks Technical support phone number usa","creator":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=millerjuliabel","name":"millerjuliabel","key":"millerjuliabel","accountId":"557058:b54e83a2-18db-4800-af79-165894da0c91","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"julia miller","active":false,"timeZone":"US/Central"},"subtasks":[],"reporter":{"self":"https://eucalyptus.atlassian.net/rest/api/2/user?username=millerjuliabel","name":"millerjuliabel","key":"millerjuliabel","accountId":"557058:b54e83a2-18db-4800-af79-165894da0c91","avatarUrls":{"48x48":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=48&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3FavatarId%3D10122%26noRedirect%3Dtrue","24x24":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=24&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dsmall%26avatarId%3D10122%26noRedirect%3Dtrue","16x16":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=16&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dxsmall%26avatarId%3D10122%26noRedirect%3Dtrue","32x32":"https://avatar-cdn.atlassian.com/bf23a50298bbb465354868c89c501d9c?s=32&d=https%3A%2F%2Feucalyptus.atlassian.net%2Fsecure%2Fuseravatar%3Fsize%3Dmedium%26avatarId%3D10122%26noRedirect%3Dtrue"},"displayName":"julia miller","active":false,"timeZone":"US/Central"},"customfield_10000":"6_*:*_1_*:*_0_*|*_10000_*:*_1_*:*_168590","aggregateprogress":{"progress":0,"total":0},"customfield_12100":"0|i03uhb:","customfield_10001":null,"customfield_10002":null,"customfield_10200":null,"customfield_10003":null,"customfield_10400":null,"customfield_12500":null,"customfield_11600":["millerjuliabel(millerjuliabel)"],"customfield_10116":null,"customfield_10117":null,"environment":null,"customfield_11800":null,"customfield_11802":null,"customfield_11805":null,"duedate":null,"customfield_11806":null,"progress":{"progress":0,"total":0},"comment":{"comments":[],"maxResults":0,"total":0,"startAt":0},"votes":{"self":"https://eucalyptus.atlassian.net/rest/api/2/issue/EUCA-12529/votes","votes":0,"hasVoted":false},"customfield_11808":null,"worklog":{"startAt":0,"maxResults":20,"total":0,"worklogs":[]}}}